[
    {
        "_id": "530",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Luke_List_(golfer)> <http://dbpedia.org/property/college> ?uri. <http://dbpedia.org/resource/K._Terry_Dornbush> <http://dbpedia.org/property/almaMater> ?uri}",
        "question": "Which college of Luke List (golfer) is the alma mater of K. Terry Dornbush",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Luke_List_(golfer)> <college> ?uri .<K._Terry_Dornbush> <almaMater> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Luke_List_(golfer)": {
                "name": "Luke_List_(golfer)",
                "mention": "Luke List (golfer)",
                "l_pos": 17,
                "r_pos": 34
            },
            "?uri": {
                "name": "?uri",
                "mention": "college",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/K._Terry_Dornbush": {
                "name": "K._Terry_Dornbush",
                "mention": "K. Terry Dornbush",
                "l_pos": 57,
                "r_pos": 73
            }
        }
    },
    {
        "_id": "4415",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/order> <http://dbpedia.org/resource/Bacillales> . ?uri <http://dbpedia.org/property/domain> <http://dbpedia.org/resource/Bacteria> }",
        "question": "How many bacterias have taxonomy as Bacillales and domain as Bacteria? ",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <order> <Bacillales> .?uri <domain> <Bacteria> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "bacterias",
                "l_pos": 9,
                "r_pos": 17
            },
            "http://dbpedia.org/resource/Bacillales": {
                "name": "Bacillales",
                "mention": "Bacillales",
                "l_pos": 36,
                "r_pos": 45
            },
            "http://dbpedia.org/resource/Bacteria": {
                "name": "Bacteria",
                "mention": "Bacteria",
                "l_pos": 61,
                "r_pos": 68
            }
        }
    },
    {
        "_id": "4525",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }",
        "question": "Name the ones who debuted in the San Francisco 49ers.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <debutTeam> <San_Francisco_49ers> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "Name",
                "l_pos": 0,
                "r_pos": 3
            },
            "http://dbpedia.org/resource/San_Francisco_49ers": {
                "name": "San_Francisco_49ers",
                "mention": "San Francisco 49ers",
                "l_pos": 33,
                "r_pos": 51
            }
        }
    },
    {
        "_id": "3526",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season> <http://dbpedia.org/ontology/homeStadium> ?uri }",
        "question": "name the home stadium of FC Spartak Moscow season 2011-12",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <2011\u201312_FC_Spartak_Moscow_season> <homeStadium> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/2011\u201312_FC_Spartak_Moscow_season": {
                "name": "2011\u201312_FC_Spartak_Moscow_season",
                "mention": "FC Spartak Moscow season",
                "l_pos": 25,
                "r_pos": 48
            },
            "?uri": {
                "name": "?uri",
                "mention": "home stadium",
                "l_pos": 9,
                "r_pos": 20
            }
        }
    },
    {
        "_id": "2418",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }",
        "question": "Count the  origin of the beverages which have been originated in england /",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <origin> <England> .?x <origin> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "beverages",
                "l_pos": 25,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/England": {
                "name": "England",
                "mention": "england",
                "l_pos": 65,
                "r_pos": 71
            },
            "?uri": {
                "name": "?uri",
                "mention": "origin",
                "l_pos": 11,
                "r_pos": 16
            }
        }
    },
    {
        "_id": "463",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "question": "Name the members of youth clubs which have Camp Nou as their homeground.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <ground> <Camp_Nou> .?uri <youthclubs> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "youth clubs",
                "l_pos": 20,
                "r_pos": 30
            },
            "http://dbpedia.org/resource/Camp_Nou": {
                "name": "Camp_Nou",
                "mention": "Camp Nou",
                "l_pos": 43,
                "r_pos": 50
            },
            "?uri": {
                "name": "?uri",
                "mention": "members",
                "l_pos": 9,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "1061",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Alexandre_Tichonov> <http://dbpedia.org/property/university> ?uri. <http://dbpedia.org/resource/Valentin_Muratov> <http://dbpedia.org/property/placeOfDeath> ?uri}",
        "question": "Which university of Alexandre Tichonov is the place of death of Valentin Muratov /",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Alexandre_Tichonov> <university> ?uri .<Valentin_Muratov> <placeOfDeath> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Alexandre_Tichonov": {
                "name": "Alexandre_Tichonov",
                "mention": "Alexandre Tichonov",
                "l_pos": 20,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "university",
                "l_pos": 6,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Valentin_Muratov": {
                "name": "Valentin_Muratov",
                "mention": "Valentin Muratov",
                "l_pos": 64,
                "r_pos": 79
            }
        }
    },
    {
        "_id": "30",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)> <http://dbpedia.org/ontology/militaryBranch> ?x . ?x <http://dbpedia.org/property/mascot> ?uri  . }",
        "question": "Name the mascot of the military branch of William Harper.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <William_Harper_(Rhodesian_politician)> <militaryBranch> ?x .?x <mascot> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/William_Harper_(Rhodesian_politician)": {
                "name": "William_Harper_(Rhodesian_politician)",
                "mention": "William Harper",
                "l_pos": 42,
                "r_pos": 55
            },
            "?x": {
                "name": "?x",
                "mention": "military branch",
                "l_pos": 23,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "mascot",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "1207",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }",
        "question": "Is lion an animal?",
        "readable_sparql": "ASK WHERE { <Lion> <kingdom> <Animal> . }",
        "node_set": {
            "http://dbpedia.org/resource/Lion": {
                "name": "Lion",
                "mention": "lion",
                "l_pos": 3,
                "r_pos": 6
            },
            "http://dbpedia.org/resource/Animal": {
                "name": "Animal",
                "mention": "animal",
                "l_pos": 11,
                "r_pos": 16
            }
        }
    },
    {
        "_id": "358",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Master's_Sun> <http://dbpedia.org/ontology/starring> ?x . ?x <http://dbpedia.org/property/religion> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "What is the religion of the person who is in the cast of Master's Sun> ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Master's_Sun> <starring> ?x .?x <religion> ?uri .?x <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "http://dbpedia.org/resource/Master's_Sun": {
                "name": "Master's_Sun",
                "mention": "Master's Sun",
                "l_pos": 57,
                "r_pos": 68
            },
            "?x": {
                "name": "?x",
                "mention": "person",
                "l_pos": 28,
                "r_pos": 33
            },
            "?uri": {
                "name": "?uri",
                "mention": "religion",
                "l_pos": 12,
                "r_pos": 19
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "person",
                "l_pos": 28,
                "r_pos": 33
            }
        }
    },
    {
        "_id": "2314",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri }",
        "question": "What is a salthill?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Salthill> <type> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Salthill": {
                "name": "Salthill",
                "mention": "salthill",
                "l_pos": 10,
                "r_pos": 17
            },
            "?uri": {
                "name": "?uri",
                "mention": "What",
                "l_pos": 0,
                "r_pos": 3
            }
        }
    },
    {
        "_id": "1104",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }",
        "question": " Count the participants of the NBA.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <league> <National_Basketball_Association> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "participants",
                "l_pos": 11,
                "r_pos": 22
            },
            "http://dbpedia.org/resource/National_Basketball_Association": {
                "name": "National_Basketball_Association",
                "mention": "NBA",
                "l_pos": 31,
                "r_pos": 33
            }
        }
    },
    {
        "_id": "1226",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }",
        "question": "Count the number of judges who've come on CTV network shows.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <network> <CTV_Television_Network> .?x <judges> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "shows",
                "l_pos": 54,
                "r_pos": 58
            },
            "http://dbpedia.org/resource/CTV_Television_Network": {
                "name": "CTV_Television_Network",
                "mention": "CTV network",
                "l_pos": 42,
                "r_pos": 52
            },
            "?uri": {
                "name": "?uri",
                "mention": "judges",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "500",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/Statelessness>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "question": "What writers have nationality as Statelessness?  ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <nationality> <Statelessness> .?uri <22-rdf-syntax-ns#type> <Writer> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "writers",
                "l_pos": 5,
                "r_pos": 11
            },
            "http://dbpedia.org/resource/Statelessness": {
                "name": "Statelessness",
                "mention": "Statelessness",
                "l_pos": 33,
                "r_pos": 45
            },
            "http://dbpedia.org/ontology/Writer": {
                "name": "Writer",
                "mention": "writers",
                "l_pos": 5,
                "r_pos": 11
            }
        }
    },
    {
        "_id": "3998",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/recordLabel> <http://dbpedia.org/resource/Sony_Music_Entertainment> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "How many movies have their music signed up with Sony Music Entertainment.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <recordLabel> <Sony_Music_Entertainment> .?uri <musicComposer> ?x .?uri <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "music",
                "l_pos": 27,
                "r_pos": 31
            },
            "http://dbpedia.org/resource/Sony_Music_Entertainment": {
                "name": "Sony_Music_Entertainment",
                "mention": "Sony Music Entertainment",
                "l_pos": 48,
                "r_pos": 71
            },
            "?uri": {
                "name": "?uri",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "226",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }",
        "question": "Who is the performer of album which has the song \"To Where You Are\" ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <To_Where_You_Are> <album> ?x .?x <artist> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/To_Where_You_Are": {
                "name": "To_Where_You_Are",
                "mention": "To Where You Are",
                "l_pos": 50,
                "r_pos": 65
            },
            "?x": {
                "name": "?x",
                "mention": "album",
                "l_pos": 24,
                "r_pos": 28
            },
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            }
        }
    },
    {
        "_id": "3320",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens> . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "question": "Count the awards won by the people who graduated from the National and Kapodistrian University of Athens.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <almaMater> <National_and_Kapodistrian_University_of_Athens> .?x <award> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 28,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/National_and_Kapodistrian_University_of_Athens": {
                "name": "National_and_Kapodistrian_University_of_Athens",
                "mention": "National and Kapodistrian University of Athens",
                "l_pos": 58,
                "r_pos": 103
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "1234",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cascade_Airways> <http://dbpedia.org/property/hubs> ?uri }",
        "question": "?What are the airline hubs of Cascade Airways",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Cascade_Airways> <hubs> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Cascade_Airways": {
                "name": "Cascade_Airways",
                "mention": "Cascade Airways",
                "l_pos": 30,
                "r_pos": 44
            },
            "?uri": {
                "name": "?uri",
                "mention": "hubs",
                "l_pos": 22,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "1442",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?x <http://dbpedia.org/property/mascot> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
        "question": "List the mascot of the universities which are a part of  National Collegiate Athletic Association.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <athletics> <National_Collegiate_Athletic_Association> .?x <mascot> ?uri .?x <22-rdf-syntax-ns#type> <University> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "universities",
                "l_pos": 23,
                "r_pos": 34
            },
            "http://dbpedia.org/resource/National_Collegiate_Athletic_Association": {
                "name": "National_Collegiate_Athletic_Association",
                "mention": "National Collegiate Athletic Association",
                "l_pos": 57,
                "r_pos": 96
            },
            "?uri": {
                "name": "?uri",
                "mention": "mascot",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/University": {
                "name": "University",
                "mention": "universities",
                "l_pos": 23,
                "r_pos": 34
            }
        }
    },
    {
        "_id": "1307",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Sarah_Kazemy> <http://dbpedia.org/ontology/citizenship> ?uri. <http://dbpedia.org/resource/Cervelle_de_canut> <http://dbpedia.org/ontology/country> ?uri}",
        "question": "What is the citizenship of the Sarah Kazemy and land of the Cervelle de canut",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Sarah_Kazemy> <citizenship> ?uri .<Cervelle_de_canut> <country> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Sarah_Kazemy": {
                "name": "Sarah_Kazemy",
                "mention": "Sarah Kazemy",
                "l_pos": 31,
                "r_pos": 42
            },
            "?uri": {
                "name": "?uri",
                "mention": "citizenship",
                "l_pos": 12,
                "r_pos": 22
            },
            "http://dbpedia.org/resource/Cervelle_de_canut": {
                "name": "Cervelle_de_canut",
                "mention": "Cervelle de canut",
                "l_pos": 60,
                "r_pos": 76
            }
        }
    },
    {
        "_id": "3427",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }",
        "question": "Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion",
        "readable_sparql": "ASK WHERE { <Mazhar_Ul_Haq_High_School,_Beerwah> <religiousAffiliation> <Islam> . }",
        "node_set": {
            "http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah": {
                "name": "Mazhar_Ul_Haq_High_School,_Beerwah",
                "mention": "Mazhar Ul Haq High School, Beerwah",
                "l_pos": 0,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Islam": {
                "name": "Islam",
                "mention": "Islamic",
                "l_pos": 52,
                "r_pos": 58
            }
        }
    },
    {
        "_id": "2618",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/author> <http://dbpedia.org/resource/K._W._Jeter> . ?x <http://dbpedia.org/ontology/series> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
        "question": "List the series of the books whose author is K. W. Jeter.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <author> <K._W._Jeter> .?x <series> ?uri .?x <22-rdf-syntax-ns#type> <Book> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "books",
                "l_pos": 23,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/K._W._Jeter": {
                "name": "K._W._Jeter",
                "mention": "K. W. Jeter",
                "l_pos": 45,
                "r_pos": 55
            },
            "?uri": {
                "name": "?uri",
                "mention": "series",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Book": {
                "name": "Book",
                "mention": "books",
                "l_pos": 23,
                "r_pos": 27
            }
        }
    },
    {
        "_id": "1913",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri }",
        "question": "Who did Bruce Bochy play for ? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Bruce_Bochy> <team> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Bruce_Bochy": {
                "name": "Bruce_Bochy",
                "mention": "Bruce Bochy",
                "l_pos": 8,
                "r_pos": 18
            },
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            }
        }
    },
    {
        "_id": "1262",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> }",
        "question": "what are some journals of academic Philosophy",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <discipline> <Philosophy> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "journals",
                "l_pos": 14,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Philosophy": {
                "name": "Philosophy",
                "mention": "Philosophy",
                "l_pos": 35,
                "r_pos": 44
            }
        }
    },
    {
        "_id": "4196",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }",
        "question": "What are some products manufactured by Sony? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <manufacturer> <Sony> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "products manufactured",
                "l_pos": 14,
                "r_pos": 34
            },
            "http://dbpedia.org/resource/Sony": {
                "name": "Sony",
                "mention": "Sony",
                "l_pos": 39,
                "r_pos": 42
            }
        }
    },
    {
        "_id": "1379",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Steve_Burke_(businessman)> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "List the television shows whose network's executive officer is Steve Burke.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <keyPerson> <Steve_Burke_(businessman)> .?uri <network> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "network",
                "l_pos": 32,
                "r_pos": 38
            },
            "http://dbpedia.org/resource/Steve_Burke_(businessman)": {
                "name": "Steve_Burke_(businessman)",
                "mention": "Steve Burke",
                "l_pos": 63,
                "r_pos": 73
            },
            "?uri": {
                "name": "?uri",
                "mention": "television shows",
                "l_pos": 9,
                "r_pos": 24
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "television shows",
                "l_pos": 9,
                "r_pos": 24
            }
        }
    },
    {
        "_id": "933",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }",
        "question": "Count all the games whose distributors are located in America",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <country> <United_States> .?uri <distributor> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "distributors",
                "l_pos": 26,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/United_States": {
                "name": "United_States",
                "mention": "America",
                "l_pos": 54,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "games",
                "l_pos": 14,
                "r_pos": 18
            }
        }
    }
]