[
    {
        "_id": "2667",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles> <http://dbpedia.org/ontology/silverMedalist> ?uri. <http://dbpedia.org/resource/Switzerland_at_the_2008_Summer_Olympics> <http://dbpedia.org/property/flagbearer> ?uri}",
        "question": "Which  siler medalist of the Tennis at the 2012 Summer Olympics  Men's singles was also the  flagbearer of the Switzerland at the 2008 Summer Olympics",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles> <silverMedalist> ?uri .<Switzerland_at_the_2008_Summer_Olympics> <flagbearer> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles": {
                "name": "Tennis_at_the_2012_Summer_Olympics_\u2013_Men's_singles",
                "mention": "Tennis at the 2012 Summer Olympics  Men's singles",
                "l_pos": 29,
                "r_pos": 77
            },
            "?uri": {
                "name": "?uri",
                "mention": "flagbearer",
                "l_pos": 93,
                "r_pos": 102
            },
            "http://dbpedia.org/resource/Switzerland_at_the_2008_Summer_Olympics": {
                "name": "Switzerland_at_the_2008_Summer_Olympics",
                "mention": "Switzerland at the 2008 Summer Olympics",
                "l_pos": 111,
                "r_pos": 149
            }
        }
    }
]