[
    {
        "_id": "29",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season> <http://dbpedia.org/property/name> ?uri. <http://dbpedia.org/resource/2009\u201310_Middlesbrough_F.C._season> <http://dbpedia.org/ontology/manager> ?uri}",
        "question": "Who is the common manager of Aston Villa 2000-02 season and also the manager of Middlesbrough F.C. season 2009-10",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <2000\u201301_Aston_Villa_F.C._season> <name> ?uri .<2009\u201310_Middlesbrough_F.C._season> <manager> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/2000\u201301_Aston_Villa_F.C._season": {
                "name": "2000\u201301_Aston_Villa_F.C._season",
                "mention": "Aston Villa 2000-02 season",
                "l_pos": 29,
                "r_pos": 54
            },
            "?uri": {
                "name": "?uri",
                "mention": "manager",
                "l_pos": 18,
                "r_pos": 24
            },
            "http://dbpedia.org/resource/2009\u201310_Middlesbrough_F.C._season": {
                "name": "2009\u201310_Middlesbrough_F.C._season",
                "mention": "Middlesbrough F.C. season 2009-10",
                "l_pos": 80,
                "r_pos": 112
            }
        }
    },
    {
        "_id": "2974",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Potato> . ?x <http://dbpedia.org/ontology/ingredient> ?uri }",
        "question": "How many other ingredient are there in the foods whihch have one of the ingredient as Potato ?",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <ingredient> <Potato> .?x <ingredient> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "foods",
                "l_pos": 43,
                "r_pos": 47
            },
            "http://dbpedia.org/resource/Potato": {
                "name": "Potato",
                "mention": "Potato",
                "l_pos": 86,
                "r_pos": 91
            },
            "?uri": {
                "name": "?uri",
                "mention": "other ingredient",
                "l_pos": 9,
                "r_pos": 24
            }
        }
    },
    {
        "_id": "4264",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/riverMouth> <http://dbpedia.org/resource/Thames_Estuary> . ?uri <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Reading,_Berkshire>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River>}",
        "question": "Name the river with mouth is Thames Estuary and passes through Reading Berkshire ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <riverMouth> <Thames_Estuary> .?uri <city> <Reading,_Berkshire> .?uri <22-rdf-syntax-ns#type> <River> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "river",
                "l_pos": 9,
                "r_pos": 13
            },
            "http://dbpedia.org/resource/Thames_Estuary": {
                "name": "Thames_Estuary",
                "mention": "Thames Estuary",
                "l_pos": 29,
                "r_pos": 42
            },
            "http://dbpedia.org/resource/Reading,_Berkshire": {
                "name": "Reading,_Berkshire",
                "mention": "Reading Berkshire",
                "l_pos": 63,
                "r_pos": 79
            },
            "http://dbpedia.org/ontology/River": {
                "name": "River",
                "mention": "river",
                "l_pos": 9,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "787",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/usedInWar> <http://dbpedia.org/resource/American_Revolutionary_War> . ?x <http://dbpedia.org/property/origin> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Weapon>}",
        "question": "List the origin of the weapons which were used in the American Revolutionary War.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <usedInWar> <American_Revolutionary_War> .?x <origin> ?uri .?x <22-rdf-syntax-ns#type> <Weapon> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "weapons",
                "l_pos": 23,
                "r_pos": 29
            },
            "http://dbpedia.org/resource/American_Revolutionary_War": {
                "name": "American_Revolutionary_War",
                "mention": "American Revolutionary War",
                "l_pos": 54,
                "r_pos": 79
            },
            "?uri": {
                "name": "?uri",
                "mention": "origin",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Weapon": {
                "name": "Weapon",
                "mention": "weapons",
                "l_pos": 23,
                "r_pos": 29
            }
        }
    },
    {
        "_id": "3668",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/education> <http://dbpedia.org/resource/Saint_Petersburg>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "question": "List few authors whose education took place in Saint Petersburg ?   ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <education> <Saint_Petersburg> .?uri <22-rdf-syntax-ns#type> <Writer> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "authors",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Saint_Petersburg": {
                "name": "Saint_Petersburg",
                "mention": "Saint Petersburg",
                "l_pos": 47,
                "r_pos": 62
            },
            "http://dbpedia.org/ontology/Writer": {
                "name": "Writer",
                "mention": "authors",
                "l_pos": 9,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "4741",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Liverpool_City_Region> <http://dbpedia.org/ontology/part> ?uri }",
        "question": "Name the part of Liverpool city region ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Liverpool_City_Region> <part> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Liverpool_City_Region": {
                "name": "Liverpool_City_Region",
                "mention": "Liverpool city region",
                "l_pos": 17,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "part",
                "l_pos": 9,
                "r_pos": 12
            }
        }
    },
    {
        "_id": "4075",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Temenos_Group> <http://dbpedia.org/property/foundation> ?uri. <http://dbpedia.org/resource/Jerzy_J\u00f3zef_Potocki> <http://dbpedia.org/property/placeOfDeath> ?uri}",
        "question": "What foundation place of Temenos Group is the death palce of jerzy Jzef Poocki ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Temenos_Group> <foundation> ?uri .<Jerzy_J\u00f3zef_Potocki> <placeOfDeath> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Temenos_Group": {
                "name": "Temenos_Group",
                "mention": "Temenos Group",
                "l_pos": 25,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "foundation place",
                "l_pos": 5,
                "r_pos": 20
            },
            "http://dbpedia.org/resource/Jerzy_J\u00f3zef_Potocki": {
                "name": "Jerzy_J\u00f3zef_Potocki",
                "mention": "jerzy Jzef Poocki",
                "l_pos": 61,
                "r_pos": 77
            }
        }
    },
    {
        "_id": "4230",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }",
        "question": "List the children of the parent of Marvin Bush.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Marvin_Bush> <parent> ?x .?x <children> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Marvin_Bush": {
                "name": "Marvin_Bush",
                "mention": "Marvin Bush",
                "l_pos": 35,
                "r_pos": 45
            },
            "?x": {
                "name": "?x",
                "mention": "parent",
                "l_pos": 25,
                "r_pos": 30
            },
            "?uri": {
                "name": "?uri",
                "mention": "children",
                "l_pos": 9,
                "r_pos": 16
            }
        }
    },
    {
        "_id": "328",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Korea_Presbyterian_Theological_Seminary> <http://dbpedia.org/property/nickname> ?uri. <http://dbpedia.org/resource/Celal_Bayar_University> <http://dbpedia.org/property/mascot> ?uri}",
        "question": "Which mascot of Celal Bayer university is also the nickname of korea Presbyterian Theological Seminar ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Korea_Presbyterian_Theological_Seminary> <nickname> ?uri .<Celal_Bayar_University> <mascot> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Korea_Presbyterian_Theological_Seminary": {
                "name": "Korea_Presbyterian_Theological_Seminary",
                "mention": "korea Presbyterian Theological Seminar",
                "l_pos": 63,
                "r_pos": 100
            },
            "?uri": {
                "name": "?uri",
                "mention": "mascot",
                "l_pos": 6,
                "r_pos": 11
            },
            "http://dbpedia.org/resource/Celal_Bayar_University": {
                "name": "Celal_Bayar_University",
                "mention": "Celal Bayer university",
                "l_pos": 16,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "4320",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/Elizabeth_II>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
        "question": "Which countries are led by Elizabeth II?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <leaderName> <Elizabeth_II> .?uri <22-rdf-syntax-ns#type> <Country> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "countries",
                "l_pos": 6,
                "r_pos": 14
            },
            "http://dbpedia.org/resource/Elizabeth_II": {
                "name": "Elizabeth_II",
                "mention": "Elizabeth II",
                "l_pos": 27,
                "r_pos": 38
            },
            "http://dbpedia.org/ontology/Country": {
                "name": "Country",
                "mention": "countries",
                "l_pos": 6,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "245",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }",
        "question": "Count all the scientologists.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <religion> <Scientology> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "scientologists",
                "l_pos": 14,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/Scientology": {
                "name": "Scientology",
                "mention": "scientologists",
                "l_pos": 14,
                "r_pos": 27
            }
        }
    },
    {
        "_id": "941",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/formerChoreographer> <http://dbpedia.org/resource/Igor_Shpillband> . ?x <http://dbpedia.org/ontology/formerPartner> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FigureSkater>}",
        "question": "List the former partner of the figure skaters whose former choreographer was Igor Shpillband.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <formerChoreographer> <Igor_Shpillband> .?x <formerPartner> ?uri .?x <22-rdf-syntax-ns#type> <FigureSkater> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "figure skaters",
                "l_pos": 31,
                "r_pos": 44
            },
            "http://dbpedia.org/resource/Igor_Shpillband": {
                "name": "Igor_Shpillband",
                "mention": "Igor Shpillband",
                "l_pos": 77,
                "r_pos": 91
            },
            "?uri": {
                "name": "?uri",
                "mention": "former partner",
                "l_pos": 9,
                "r_pos": 22
            },
            "http://dbpedia.org/ontology/FigureSkater": {
                "name": "FigureSkater",
                "mention": "figure skaters",
                "l_pos": 31,
                "r_pos": 44
            }
        }
    },
    {
        "_id": "1774",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "question": "Count the total religions followed by the ones living in England.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <residence> <England> .?x <religion> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "the ones",
                "l_pos": 38,
                "r_pos": 45
            },
            "http://dbpedia.org/resource/England": {
                "name": "England",
                "mention": "England",
                "l_pos": 57,
                "r_pos": 63
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 16,
                "r_pos": 24
            }
        }
    },
    {
        "_id": "2321",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }",
        "question": "Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',",
        "readable_sparql": "ASK WHERE { <Connecticut_River> <rightTributary> <White_River_(Vermont)> . }",
        "node_set": {
            "http://dbpedia.org/resource/Connecticut_River": {
                "name": "Connecticut_River",
                "mention": "connecticut river",
                "l_pos": 35,
                "r_pos": 51
            },
            "http://dbpedia.org/resource/White_River_(Vermont)": {
                "name": "White_River_(Vermont)",
                "mention": "white river",
                "l_pos": 9,
                "r_pos": 19
            }
        }
    },
    {
        "_id": "2927",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/Basketball> . ?x <http://dbpedia.org/property/athletics> ?uri }",
        "question": "Count the number of sports played by the universities whose one of the sports is basketball ?",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <athletics> <Basketball> .?x <athletics> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "universities",
                "l_pos": 41,
                "r_pos": 52
            },
            "http://dbpedia.org/resource/Basketball": {
                "name": "Basketball",
                "mention": "basketball",
                "l_pos": 81,
                "r_pos": 90
            },
            "?uri": {
                "name": "?uri",
                "mention": "sports",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "581",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Creatures_(company)> . ?uri <http://dbpedia.org/property/composer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame>}",
        "question": "What are some video games whose music is composed by an employee of the company Creatures?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <occupation> <Creatures_(company)> .?uri <composer> ?x .?uri <22-rdf-syntax-ns#type> <VideoGame> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "employee",
                "l_pos": 56,
                "r_pos": 63
            },
            "http://dbpedia.org/resource/Creatures_(company)": {
                "name": "Creatures_(company)",
                "mention": "Creatures",
                "l_pos": 80,
                "r_pos": 88
            },
            "?uri": {
                "name": "?uri",
                "mention": "video games",
                "l_pos": 14,
                "r_pos": 24
            },
            "http://dbpedia.org/ontology/VideoGame": {
                "name": "VideoGame",
                "mention": "video games",
                "l_pos": 14,
                "r_pos": 24
            }
        }
    },
    {
        "_id": "1582",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/creator> <http://dbpedia.org/resource/Russell_T_Davies> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "Give me some shows related to the ones created by Russell Davies",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <creator> <Russell_T_Davies> .?uri <related> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "ones",
                "l_pos": 34,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Russell_T_Davies": {
                "name": "Russell_T_Davies",
                "mention": "Russell Davies",
                "l_pos": 50,
                "r_pos": 63
            },
            "?uri": {
                "name": "?uri",
                "mention": "some shows",
                "l_pos": 8,
                "r_pos": 17
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "some shows",
                "l_pos": 8,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "4048",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "question": "List the sports played in private universities.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <type> <Private_university> .?x <sport> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "private universities",
                "l_pos": 26,
                "r_pos": 45
            },
            "http://dbpedia.org/resource/Private_university": {
                "name": "Private_university",
                "mention": "private universities",
                "l_pos": 26,
                "r_pos": 45
            },
            "?uri": {
                "name": "?uri",
                "mention": "sports",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "1587",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "question": "Count the different alma maters of people employed by the CNN",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <employer> <CNN> .?x <almaMater> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 35,
                "r_pos": 40
            },
            "http://dbpedia.org/resource/CNN": {
                "name": "CNN",
                "mention": "CNN",
                "l_pos": 58,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "alma maters",
                "l_pos": 20,
                "r_pos": 30
            }
        }
    },
    {
        "_id": "2902",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }",
        "question": "Name a famous relative of barry voight",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <relative> <Barry_Voight> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "relative",
                "l_pos": 14,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Barry_Voight": {
                "name": "Barry_Voight",
                "mention": "barry voight",
                "l_pos": 26,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "4694",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/openingTheme> <http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name> . ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Massachusetts>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "Which television show is based in Massachusetts and has opening theme as \"Where Everybody Knows Your Name\" ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <openingTheme> <Where_Everybody_Knows_Your_Name> .?uri <location> <Massachusetts> .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "television show",
                "l_pos": 6,
                "r_pos": 20
            },
            "http://dbpedia.org/resource/Where_Everybody_Knows_Your_Name": {
                "name": "Where_Everybody_Knows_Your_Name",
                "mention": "Where Everybody Knows Your Name",
                "l_pos": 74,
                "r_pos": 104
            },
            "http://dbpedia.org/resource/Massachusetts": {
                "name": "Massachusetts",
                "mention": "Massachusetts",
                "l_pos": 34,
                "r_pos": 46
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "television show",
                "l_pos": 6,
                "r_pos": 20
            }
        }
    },
    {
        "_id": "1245",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }",
        "question": "Name some people working at someplace owned by News Corp.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <owners> <News_Corp> .?uri <employer> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "someplace",
                "l_pos": 28,
                "r_pos": 36
            },
            "http://dbpedia.org/resource/News_Corp": {
                "name": "News_Corp",
                "mention": "News Corp",
                "l_pos": 47,
                "r_pos": 55
            },
            "?uri": {
                "name": "?uri",
                "mention": "people",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "401",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <http://dbpedia.org/ontology/coach> ?uri }",
        "question": "Who coached the marquet golden eagels during 2013",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <2013\u201314_Marquette_Golden_Eagles_men's_basketball_team> <coach> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/2013\u201314_Marquette_Golden_Eagles_men's_basketball_team": {
                "name": "2013\u201314_Marquette_Golden_Eagles_men's_basketball_team",
                "mention": "marquet golden eagels",
                "l_pos": 16,
                "r_pos": 36
            },
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            }
        }
    },
    {
        "_id": "129",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/Schibsted>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
        "question": "What newspapers's owners is Schibsted",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <owners> <Schibsted> .?uri <22-rdf-syntax-ns#type> <Newspaper> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "newspapers",
                "l_pos": 5,
                "r_pos": 14
            },
            "http://dbpedia.org/resource/Schibsted": {
                "name": "Schibsted",
                "mention": "Schibsted",
                "l_pos": 28,
                "r_pos": 36
            },
            "http://dbpedia.org/ontology/Newspaper": {
                "name": "Newspaper",
                "mention": "newspapers",
                "l_pos": 5,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "2599",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> }",
        "question": "What fictional character's species is American Pekin duck",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <species> <American_Pekin_duck> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "species",
                "l_pos": 27,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/American_Pekin_duck": {
                "name": "American_Pekin_duck",
                "mention": "American Pekin duck",
                "l_pos": 38,
                "r_pos": 56
            }
        }
    },
    {
        "_id": "2972",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mekong_River_Commission> <http://dbpedia.org/property/membership> ?uri }",
        "question": "List all the memebers of  Mekong River Commission?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Mekong_River_Commission> <membership> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Mekong_River_Commission": {
                "name": "Mekong_River_Commission",
                "mention": "Mekong River Commission",
                "l_pos": 26,
                "r_pos": 48
            },
            "?uri": {
                "name": "?uri",
                "mention": "memebers",
                "l_pos": 13,
                "r_pos": 20
            }
        }
    }
]