[
    {
        "_id": "4863",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Fr._Agnel_Multipurpose_School_and_Junior_College> <http://dbpedia.org/ontology/sport> ?uri. <http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao> <http://dbpedia.org/ontology/athletics> ?uri}",
        "question": "List the common sports between Fr. Agnel Multipurpose School  and Jamiatu Muslim Mindanao",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Fr._Agnel_Multipurpose_School_and_Junior_College> <sport> ?uri .<Jamiatu_Muslim_Mindanao> <athletics> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Fr._Agnel_Multipurpose_School_and_Junior_College": {
                "name": "Fr._Agnel_Multipurpose_School_and_Junior_College",
                "mention": "Fr. Agnel Multipurpose School",
                "l_pos": 31,
                "r_pos": 59
            },
            "?uri": {
                "name": "?uri",
                "mention": "sports",
                "l_pos": 16,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Jamiatu_Muslim_Mindanao": {
                "name": "Jamiatu_Muslim_Mindanao",
                "mention": "Jamiatu Muslim Mindanao",
                "l_pos": 66,
                "r_pos": 88
            }
        }
    },
    {
        "_id": "893",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }",
        "question": "Does Walt Disney Studio have a subsidiary called PixarCascadia_",
        "readable_sparql": "ASK WHERE { <Walt_Disney_Studios_(division)> <subsidiary> <Pixar> . }",
        "node_set": {
            "http://dbpedia.org/resource/Walt_Disney_Studios_(division)": {
                "name": "Walt_Disney_Studios_(division)",
                "mention": "Walt Disney Studio",
                "l_pos": 5,
                "r_pos": 22
            },
            "http://dbpedia.org/resource/Pixar": {
                "name": "Pixar",
                "mention": "Pixar",
                "l_pos": 49,
                "r_pos": 53
            }
        }
    },
    {
        "_id": "4252",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/honours> <http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}",
        "question": "Count the birthplaces of recepients of the National Museum of Racing and Hall of Fame.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <honours> <National_Museum_of_Racing_and_Hall_of_Fame> .?x <birthPlace> ?uri .?uri <22-rdf-syntax-ns#type> <Place> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "recepients",
                "l_pos": 25,
                "r_pos": 34
            },
            "http://dbpedia.org/resource/National_Museum_of_Racing_and_Hall_of_Fame": {
                "name": "National_Museum_of_Racing_and_Hall_of_Fame",
                "mention": "National Museum of Racing and Hall of Fame",
                "l_pos": 43,
                "r_pos": 84
            },
            "?uri": {
                "name": "?uri",
                "mention": "birthplaces",
                "l_pos": 10,
                "r_pos": 20
            },
            "http://dbpedia.org/ontology/Place": {
                "name": "Place",
                "mention": "birthplaces",
                "l_pos": 10,
                "r_pos": 20
            }
        }
    },
    {
        "_id": "73",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }",
        "question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <anthem> <Oj,_svijetla_majska_zoro> .?x <currency> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "country",
                "l_pos": 30,
                "r_pos": 36
            },
            "http://dbpedia.org/resource/Oj,_svijetla_majska_zoro": {
                "name": "Oj,_svijetla_majska_zoro",
                "mention": "Oj, svijetla majska zoro",
                "l_pos": 54,
                "r_pos": 77
            },
            "?uri": {
                "name": "?uri",
                "mention": "currency",
                "l_pos": 14,
                "r_pos": 21
            }
        }
    },
    {
        "_id": "1374",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Kira_Plastinina> <http://dbpedia.org/property/placeOfBirth> ?uri. <http://dbpedia.org/resource/Sergey_Ryazansky> <http://dbpedia.org/property/placeOfBirth> ?uri . }",
        "question": "What is the place of birth of the Kira Plastinina and Sergey Ryazansky",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Kira_Plastinina> <placeOfBirth> ?uri .<Sergey_Ryazansky> <placeOfBirth> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Kira_Plastinina": {
                "name": "Kira_Plastinina",
                "mention": "Kira Plastinina",
                "l_pos": 34,
                "r_pos": 48
            },
            "?uri": {
                "name": "?uri",
                "mention": "place of birth",
                "l_pos": 12,
                "r_pos": 25
            },
            "http://dbpedia.org/resource/Sergey_Ryazansky": {
                "name": "Sergey_Ryazansky",
                "mention": "Sergey Ryazansky",
                "l_pos": 54,
                "r_pos": 69
            }
        }
    },
    {
        "_id": "2629",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri }",
        "question": "Where did ed podolak go to high school",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Ed_Podolak> <highschool> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Ed_Podolak": {
                "name": "Ed_Podolak",
                "mention": "ed podolak",
                "l_pos": 10,
                "r_pos": 19
            },
            "?uri": {
                "name": "?uri",
                "mention": "Where",
                "l_pos": 0,
                "r_pos": 4
            }
        }
    },
    {
        "_id": "4350",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }",
        "question": "Count the different genres of games published by Titus Software",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <publisher> <Titus_Software> .?x <genre> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "games",
                "l_pos": 30,
                "r_pos": 34
            },
            "http://dbpedia.org/resource/Titus_Software": {
                "name": "Titus_Software",
                "mention": "Titus Software",
                "l_pos": 49,
                "r_pos": 62
            },
            "?uri": {
                "name": "?uri",
                "mention": "genres",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "779",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "question": "Count the awards given to the recepients of the Becket fund for religious liberty.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <award> <Becket_Fund_for_Religious_Liberty> .?x <awards> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "recepients",
                "l_pos": 30,
                "r_pos": 39
            },
            "http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty": {
                "name": "Becket_Fund_for_Religious_Liberty",
                "mention": "Becket fund for religious liberty",
                "l_pos": 48,
                "r_pos": 80
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "1359",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Desilu_Productions> . ?uri <http://dbpedia.org/property/company> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "How many sitcoms were produced by the company whose predecessor was the Desilu Productions",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <predecessor> <Desilu_Productions> .?uri <company> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "company",
                "l_pos": 38,
                "r_pos": 44
            },
            "http://dbpedia.org/resource/Desilu_Productions": {
                "name": "Desilu_Productions",
                "mention": "Desilu Productions",
                "l_pos": 72,
                "r_pos": 89
            },
            "?uri": {
                "name": "?uri",
                "mention": "sitcoms",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "sitcoms",
                "l_pos": 9,
                "r_pos": 15
            }
        }
    }
]