[
    {
        "_id": "1052",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }",
        "question": "Is Microsoft office written in C++",
        "readable_sparql": "ASK WHERE { <Microsoft_Office> <programmingLanguage> <C++> . }",
        "node_set": {
            "http://dbpedia.org/resource/Microsoft_Office": {
                "name": "Microsoft_Office",
                "mention": "Microsoft office",
                "l_pos": 3,
                "r_pos": 18
            },
            "http://dbpedia.org/resource/C++": {
                "name": "C++",
                "mention": "C++",
                "l_pos": 31,
                "r_pos": 33
            }
        }
    },
    {
        "_id": "1210",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/BBC> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "List the shows whose network is run by BBC.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <owningCompany> <BBC> .?uri <network> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "network",
                "l_pos": 21,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/BBC": {
                "name": "BBC",
                "mention": "BBC",
                "l_pos": 39,
                "r_pos": 41
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 9,
                "r_pos": 13
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 9,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "1293",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/breeder> <http://dbpedia.org/resource/Willis_Sharpe_Kilmer> . ?x <http://dbpedia.org/ontology/honours> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RaceHorse>}",
        "question": "List the awards given to the race horses bred by Willis Sharpe Kilmer.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <breeder> <Willis_Sharpe_Kilmer> .?x <honours> ?uri .?x <22-rdf-syntax-ns#type> <RaceHorse> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "race horses",
                "l_pos": 29,
                "r_pos": 39
            },
            "http://dbpedia.org/resource/Willis_Sharpe_Kilmer": {
                "name": "Willis_Sharpe_Kilmer",
                "mention": "Willis Sharpe Kilmer",
                "l_pos": 49,
                "r_pos": 68
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/RaceHorse": {
                "name": "RaceHorse",
                "mention": "race horses",
                "l_pos": 29,
                "r_pos": 39
            }
        }
    },
    {
        "_id": "577",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> }",
        "question": "Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <doctoralStudent> <\u00c9tienne_Bi\u00e9ler> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "Whose",
                "l_pos": 0,
                "r_pos": 4
            },
            "http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler": {
                "name": "\u00c9tienne_Bi\u00e9ler",
                "mention": "etienne bieler\\xc9tienne_Bi\\xe9ler",
                "l_pos": 26,
                "r_pos": 59
            }
        }
    },
    {
        "_id": "4440",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/nationalMotto> <http://dbpedia.org/resource/Truth_prevails>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>}",
        "question": "Which country's national motto is \"Truth prevails\"?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <nationalMotto> <Truth_prevails> .?uri <22-rdf-syntax-ns#type> <Country> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "country",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/Truth_prevails": {
                "name": "Truth_prevails",
                "mention": "Truth prevails",
                "l_pos": 35,
                "r_pos": 48
            },
            "http://dbpedia.org/ontology/Country": {
                "name": "Country",
                "mention": "country",
                "l_pos": 6,
                "r_pos": 12
            }
        }
    },
    {
        "_id": "445",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/El\u017cbieta_Czartoryska_(1905\u20131989)> <http://dbpedia.org/property/deathPlace> ?uri. <http://dbpedia.org/resource/Charles_Journet> <http://dbpedia.org/ontology/birthPlace> ?uri}",
        "question": "What is the death place of the Elbieta Czartoryska which is also place of birth of the Charles Journet",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <El\u017cbieta_Czartoryska_(1905\u20131989)> <deathPlace> ?uri .<Charles_Journet> <birthPlace> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/El\u017cbieta_Czartoryska_(1905\u20131989)": {
                "name": "El\u017cbieta_Czartoryska_(1905\u20131989)",
                "mention": "Elbieta Czartoryska",
                "l_pos": 31,
                "r_pos": 49
            },
            "?uri": {
                "name": "?uri",
                "mention": "death place",
                "l_pos": 12,
                "r_pos": 22
            },
            "http://dbpedia.org/resource/Charles_Journet": {
                "name": "Charles_Journet",
                "mention": "Charles Journet",
                "l_pos": 87,
                "r_pos": 101
            }
        }
    },
    {
        "_id": "620",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }",
        "question": "How many players play for Chicago Bulls?",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <team> <Chicago_Bulls> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "players",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Chicago_Bulls": {
                "name": "Chicago_Bulls",
                "mention": "Chicago Bulls",
                "l_pos": 26,
                "r_pos": 38
            }
        }
    },
    {
        "_id": "1178",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Clan_McDuck> . ?uri <http://dbpedia.org/property/relatives> <http://dbpedia.org/resource/Ludwig_Von_Drake> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FictionalCharacter>}",
        "question": "What is the fictional character which has Clan McDuck and Ludwig Von Drake as relatives?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <relatives> <Clan_McDuck> .?uri <relatives> <Ludwig_Von_Drake> .?uri <22-rdf-syntax-ns#type> <FictionalCharacter> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "fictional character",
                "l_pos": 12,
                "r_pos": 30
            },
            "http://dbpedia.org/resource/Clan_McDuck": {
                "name": "Clan_McDuck",
                "mention": "Clan McDuck",
                "l_pos": 42,
                "r_pos": 52
            },
            "http://dbpedia.org/resource/Ludwig_Von_Drake": {
                "name": "Ludwig_Von_Drake",
                "mention": "Ludwig Von Drake",
                "l_pos": 58,
                "r_pos": 73
            },
            "http://dbpedia.org/ontology/FictionalCharacter": {
                "name": "FictionalCharacter",
                "mention": "fictional character",
                "l_pos": 12,
                "r_pos": 30
            }
        }
    },
    {
        "_id": "2619",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Richard_M._Sherman> . ?x <http://dbpedia.org/ontology/author> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical>}",
        "question": "List the authors of the musicals whose songwriter is Richard M. Sherman.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <musicBy> <Richard_M._Sherman> .?x <author> ?uri .?x <22-rdf-syntax-ns#type> <Musical> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "musicals",
                "l_pos": 24,
                "r_pos": 31
            },
            "http://dbpedia.org/resource/Richard_M._Sherman": {
                "name": "Richard_M._Sherman",
                "mention": "Richard M. Sherman",
                "l_pos": 53,
                "r_pos": 70
            },
            "?uri": {
                "name": "?uri",
                "mention": "authors",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/ontology/Musical": {
                "name": "Musical",
                "mention": "musicals",
                "l_pos": 24,
                "r_pos": 31
            }
        }
    },
    {
        "_id": "1846",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Michael_Jackson> . ?x <http://dbpedia.org/property/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "List the producers who produced movies starring Michael Jackson.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <starring> <Michael_Jackson> .?x <producer> ?uri .?x <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "movies",
                "l_pos": 32,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Michael_Jackson": {
                "name": "Michael_Jackson",
                "mention": "Michael Jackson",
                "l_pos": 48,
                "r_pos": 62
            },
            "?uri": {
                "name": "?uri",
                "mention": "producers",
                "l_pos": 9,
                "r_pos": 17
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "movies",
                "l_pos": 32,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "1127",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/William_Deane> <http://dbpedia.org/ontology/primeMinister> ?uri. <http://dbpedia.org/resource/Mark_Latham> <http://dbpedia.org/property/primeminister> ?uri}",
        "question": "Who is the common prime minster of William Deane and mark Latham ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <William_Deane> <primeMinister> ?uri .<Mark_Latham> <primeminister> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/William_Deane": {
                "name": "William_Deane",
                "mention": "William Deane",
                "l_pos": 35,
                "r_pos": 47
            },
            "?uri": {
                "name": "?uri",
                "mention": "prime minster",
                "l_pos": 18,
                "r_pos": 30
            },
            "http://dbpedia.org/resource/Mark_Latham": {
                "name": "Mark_Latham",
                "mention": "mark Latham",
                "l_pos": 53,
                "r_pos": 63
            }
        }
    },
    {
        "_id": "2411",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/sisterNames> <http://dbpedia.org/resource/BBC_Parliament> . ?uri <http://dbpedia.org/ontology/network> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "What shows are aired on sister channels of BBC Parliaments",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <sisterNames> <BBC_Parliament> .?uri <network> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "channels",
                "l_pos": 31,
                "r_pos": 38
            },
            "http://dbpedia.org/resource/BBC_Parliament": {
                "name": "BBC_Parliament",
                "mention": "BBC Parliaments",
                "l_pos": 43,
                "r_pos": 57
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 5,
                "r_pos": 9
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 5,
                "r_pos": 9
            }
        }
    },
    {
        "_id": "4745",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Michael_Marder> <http://dbpedia.org/property/placeOfBirth> ?uri. <http://dbpedia.org/resource/Tigran_Petrosian> <http://dbpedia.org/ontology/deathPlace> ?uri}",
        "question": "What is the place of birth of the Michael Marder which is also the  place of death of the Tigran Petrosian",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Michael_Marder> <placeOfBirth> ?uri .<Tigran_Petrosian> <deathPlace> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Michael_Marder": {
                "name": "Michael_Marder",
                "mention": "Michael Marder",
                "l_pos": 34,
                "r_pos": 47
            },
            "?uri": {
                "name": "?uri",
                "mention": "place of birth",
                "l_pos": 12,
                "r_pos": 25
            },
            "http://dbpedia.org/resource/Tigran_Petrosian": {
                "name": "Tigran_Petrosian",
                "mention": "Tigran Petrosian",
                "l_pos": 90,
                "r_pos": 105
            }
        }
    },
    {
        "_id": "4358",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dornier_Aerodyne> <http://dbpedia.org/property/nationalOrigin> ?uri. <http://dbpedia.org/resource/Hirth_Acrostar> <http://dbpedia.org/ontology/origin> ?uri}",
        "question": "What is the national origin of Dornier Aerodyne and Hirth Acrostar ?;",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Dornier_Aerodyne> <nationalOrigin> ?uri .<Hirth_Acrostar> <origin> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Dornier_Aerodyne": {
                "name": "Dornier_Aerodyne",
                "mention": "Dornier Aerodyne",
                "l_pos": 31,
                "r_pos": 46
            },
            "?uri": {
                "name": "?uri",
                "mention": "origin",
                "l_pos": 21,
                "r_pos": 26
            },
            "http://dbpedia.org/resource/Hirth_Acrostar": {
                "name": "Hirth_Acrostar",
                "mention": "Hirth Acrostar",
                "l_pos": 52,
                "r_pos": 65
            }
        }
    },
    {
        "_id": "339",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/timeZone> <http://dbpedia.org/resource/Central_European_Summer_Time> . ?uri <http://dbpedia.org/property/headquarters> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
        "question": "List the newspapers whose headquarters's time zone is Central European Summer Time.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <timeZone> <Central_European_Summer_Time> .?uri <headquarters> ?x .?uri <22-rdf-syntax-ns#type> <Newspaper> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "headquarters",
                "l_pos": 26,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Central_European_Summer_Time": {
                "name": "Central_European_Summer_Time",
                "mention": "Central European Summer Time",
                "l_pos": 54,
                "r_pos": 81
            },
            "?uri": {
                "name": "?uri",
                "mention": "newspapers",
                "l_pos": 9,
                "r_pos": 18
            },
            "http://dbpedia.org/ontology/Newspaper": {
                "name": "Newspaper",
                "mention": "newspapers",
                "l_pos": 9,
                "r_pos": 18
            }
        }
    }
]