[
    {
        "_id": "4842",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pittsburgh> <http://dbpedia.org/ontology/founder> ?uri. <http://dbpedia.org/resource/William_Cushing> <http://dbpedia.org/ontology/appointer> ?uri}",
        "question": "Which famous political figure appointed william cushing, and also founded Pittsburgh>",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Pittsburgh> <founder> ?uri .<William_Cushing> <appointer> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Pittsburgh": {
                "name": "Pittsburgh",
                "mention": "Pittsburgh",
                "l_pos": 74,
                "r_pos": 83
            },
            "?uri": {
                "name": "?uri",
                "mention": "political figure",
                "l_pos": 13,
                "r_pos": 28
            },
            "http://dbpedia.org/resource/William_Cushing": {
                "name": "William_Cushing",
                "mention": "william cushing",
                "l_pos": 40,
                "r_pos": 54
            }
        }
    },
    {
        "_id": "4838",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> }",
        "question": "Which company's division is Audi India? Correct Question",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <divisions> <Audi_India> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "company",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/Audi_India": {
                "name": "Audi_India",
                "mention": "Audi India",
                "l_pos": 28,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "2146",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }",
        "question": "Name everyone working for a company owned by Roman Abramovich.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <owningCompany> <Roman_Abramovich> .?uri <occupation> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "company",
                "l_pos": 28,
                "r_pos": 34
            },
            "http://dbpedia.org/resource/Roman_Abramovich": {
                "name": "Roman_Abramovich",
                "mention": "Roman Abramovich",
                "l_pos": 45,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "everyone",
                "l_pos": 5,
                "r_pos": 12
            }
        }
    },
    {
        "_id": "561",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/predecessor> <http://dbpedia.org/resource/Bob_C._Riley> . ?uri <http://dbpedia.org/ontology/lieutenant> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President>}",
        "question": "Name the president served by a lieutenant who succeeded Bob C Riley.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <predecessor> <Bob_C._Riley> .?uri <lieutenant> ?x .?uri <22-rdf-syntax-ns#type> <President> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "lieutenant",
                "l_pos": 31,
                "r_pos": 40
            },
            "http://dbpedia.org/resource/Bob_C._Riley": {
                "name": "Bob_C._Riley",
                "mention": "Bob C Riley",
                "l_pos": 56,
                "r_pos": 66
            },
            "?uri": {
                "name": "?uri",
                "mention": "president",
                "l_pos": 9,
                "r_pos": 17
            },
            "http://dbpedia.org/ontology/President": {
                "name": "President",
                "mention": "president",
                "l_pos": 9,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "122",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <ground> <Rosario,_Santa_Fe> .?uri <youthclubs> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "youth club",
                "l_pos": 38,
                "r_pos": 47
            },
            "http://dbpedia.org/resource/Rosario,_Santa_Fe": {
                "name": "Rosario,_Santa_Fe",
                "mention": "Rosario, Santa Fe",
                "l_pos": 64,
                "r_pos": 80
            },
            "?uri": {
                "name": "?uri",
                "mention": "those",
                "l_pos": 10,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "2710",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <party> <Malaysian_Chinese_Association> .?x <religion> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 43,
                "r_pos": 48
            },
            "http://dbpedia.org/resource/Malaysian_Chinese_Association": {
                "name": "Malaysian_Chinese_Association",
                "mention": "Malaysian and Chinese association",
                "l_pos": 65,
                "r_pos": 97
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 20,
                "r_pos": 28
            }
        }
    },
    {
        "_id": "4561",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }",
        "question": "Count the religions followed by people living in British Columbia.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <residence> <British_Columbia> .?x <religion> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 32,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/British_Columbia": {
                "name": "British_Columbia",
                "mention": "British Columbia",
                "l_pos": 49,
                "r_pos": 64
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 10,
                "r_pos": 18
            }
        }
    },
    {
        "_id": "309",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }",
        "question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <largestCity> <Papeete> .?uri <archipelago> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "archipelago",
                "l_pos": 40,
                "r_pos": 50
            },
            "http://dbpedia.org/resource/Papeete": {
                "name": "Papeete",
                "mention": "Papeete",
                "l_pos": 59,
                "r_pos": 65
            },
            "?uri": {
                "name": "?uri",
                "mention": "everything",
                "l_pos": 19,
                "r_pos": 28
            }
        }
    },
    {
        "_id": "330",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Yasmin_Paige> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "Give me some series related to the one which had Yasmin Paige in them.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <starring> <Yasmin_Paige> .?uri <related> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "one",
                "l_pos": 35,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Yasmin_Paige": {
                "name": "Yasmin_Paige",
                "mention": "Yasmin Paige",
                "l_pos": 49,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "series",
                "l_pos": 13,
                "r_pos": 18
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "series",
                "l_pos": 13,
                "r_pos": 18
            }
        }
    },
    {
        "_id": "4197",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }",
        "question": "What is the almamater of the successor of F. A. Little, Jr.? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <F._A._Little,_Jr.> <successor> ?x .?x <almaMater> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/F._A._Little,_Jr.": {
                "name": "F._A._Little,_Jr.",
                "mention": "F. A. Little, Jr.",
                "l_pos": 42,
                "r_pos": 58
            },
            "?x": {
                "name": "?x",
                "mention": "successor",
                "l_pos": 29,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "almamater",
                "l_pos": 12,
                "r_pos": 20
            }
        }
    },
    {
        "_id": "4150",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/arena> <http://dbpedia.org/resource/The_Palace_of_Auburn_Hills>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}",
        "question": "What sports team's arena is The Palace of Auburn Hills",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <arena> <The_Palace_of_Auburn_Hills> .?uri <22-rdf-syntax-ns#type> <SportsTeam> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "sports team",
                "l_pos": 5,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/The_Palace_of_Auburn_Hills": {
                "name": "The_Palace_of_Auburn_Hills",
                "mention": "The Palace of Auburn Hills",
                "l_pos": 28,
                "r_pos": 53
            },
            "http://dbpedia.org/ontology/SportsTeam": {
                "name": "SportsTeam",
                "mention": "sports team",
                "l_pos": 5,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "3437",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/California> . ?uri <http://dbpedia.org/ontology/presenter> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Award>}",
        "question": "Count all the awards which were presented by something located in California.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <headquarter> <California> .?uri <presenter> ?x .?uri <22-rdf-syntax-ns#type> <Award> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "something",
                "l_pos": 45,
                "r_pos": 53
            },
            "http://dbpedia.org/resource/California": {
                "name": "California",
                "mention": "California",
                "l_pos": 66,
                "r_pos": 75
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 14,
                "r_pos": 19
            },
            "http://dbpedia.org/ontology/Award": {
                "name": "Award",
                "mention": "awards",
                "l_pos": 14,
                "r_pos": 19
            }
        }
    },
    {
        "_id": "1334",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/superintendent> <http://dbpedia.org/resource/Michelle_D._Johnson> . ?uri <http://dbpedia.org/property/mascot> <http://dbpedia.org/resource/Gyrfalcon>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University>}",
        "question": "Among the universities having Gyrfalcon as mascot which have Michelle D. Johnson as superintendent ? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <superintendent> <Michelle_D._Johnson> .?uri <mascot> <Gyrfalcon> .?uri <22-rdf-syntax-ns#type> <University> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "universities",
                "l_pos": 10,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Michelle_D._Johnson": {
                "name": "Michelle_D._Johnson",
                "mention": "Michelle D. Johnson",
                "l_pos": 61,
                "r_pos": 79
            },
            "http://dbpedia.org/resource/Gyrfalcon": {
                "name": "Gyrfalcon",
                "mention": "Gyrfalcon",
                "l_pos": 30,
                "r_pos": 38
            },
            "http://dbpedia.org/ontology/University": {
                "name": "University",
                "mention": "universities",
                "l_pos": 10,
                "r_pos": 21
            }
        }
    },
    {
        "_id": "4774",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }",
        "question": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg",
        "readable_sparql": "ASK WHERE { <Werner_Heisenberg> <doctoralStudent> <\u0218erban_\u021ai\u021beica> . }",
        "node_set": {
            "http://dbpedia.org/resource/Werner_Heisenberg": {
                "name": "Werner_Heisenberg",
                "mention": "Werner Heisenberg",
                "l_pos": 41,
                "r_pos": 57
            },
            "http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica": {
                "name": "\u0218erban_\u021ai\u021beica",
                "mention": "Serbian Titieca",
                "l_pos": 3,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "4316",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Swedish_language> . ?uri <http://dbpedia.org/property/headquarters> <http://dbpedia.org/resource/Stockholm>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Newspaper>}",
        "question": "List the Swedish newspaper headquarted in Stockholm ? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <language> <Swedish_language> .?uri <headquarters> <Stockholm> .?uri <22-rdf-syntax-ns#type> <Newspaper> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "newspaper",
                "l_pos": 17,
                "r_pos": 25
            },
            "http://dbpedia.org/resource/Swedish_language": {
                "name": "Swedish_language",
                "mention": "Swedish",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Stockholm": {
                "name": "Stockholm",
                "mention": "Stockholm",
                "l_pos": 42,
                "r_pos": 50
            },
            "http://dbpedia.org/ontology/Newspaper": {
                "name": "Newspaper",
                "mention": "newspaper",
                "l_pos": 17,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "2159",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }",
        "question": "List the awards won by the wife of Ingrid von Rosen.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Ingrid_von_Rosen> <spouse> ?x .?x <awards> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Ingrid_von_Rosen": {
                "name": "Ingrid_von_Rosen",
                "mention": "Ingrid von Rosen",
                "l_pos": 35,
                "r_pos": 50
            },
            "?x": {
                "name": "?x",
                "mention": "wife",
                "l_pos": 27,
                "r_pos": 30
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "2666",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }",
        "question": "Name some books by Spanish speaking authors.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <language> <Spanish_language> .?uri <author> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "authors",
                "l_pos": 36,
                "r_pos": 42
            },
            "http://dbpedia.org/resource/Spanish_language": {
                "name": "Spanish_language",
                "mention": "Spanish",
                "l_pos": 19,
                "r_pos": 25
            },
            "?uri": {
                "name": "?uri",
                "mention": "books",
                "l_pos": 10,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "128",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }",
        "question": "Did Steve Sampson manage a club of Santa Clara university",
        "readable_sparql": "ASK WHERE { <Steve_Sampson> <managerClub> <Santa_Clara_University> . }",
        "node_set": {
            "http://dbpedia.org/resource/Steve_Sampson": {
                "name": "Steve_Sampson",
                "mention": "Steve Sampson",
                "l_pos": 4,
                "r_pos": 16
            },
            "http://dbpedia.org/resource/Santa_Clara_University": {
                "name": "Santa_Clara_University",
                "mention": "Santa Clara university",
                "l_pos": 35,
                "r_pos": 56
            }
        }
    },
    {
        "_id": "1273",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }",
        "question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <SummerSlam_(2004)> <venue> ?x .?x <tenant> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/SummerSlam_(2004)": {
                "name": "SummerSlam_(2004)",
                "mention": "WWF Summer Slam 2004",
                "l_pos": 46,
                "r_pos": 65
            },
            "?x": {
                "name": "?x",
                "mention": "stadium",
                "l_pos": 28,
                "r_pos": 34
            },
            "?uri": {
                "name": "?uri",
                "mention": "tenants",
                "l_pos": 13,
                "r_pos": 19
            }
        }
    },
    {
        "_id": "1259",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brown's_Corners,_Toronto> <http://dbpedia.org/ontology/municipality> ?uri. <http://dbpedia.org/resource/George_Karrys> <http://dbpedia.org/property/placeOfBirth> ?uri}",
        "question": "What is the municipality of the Brown's Corners, Toronto and also the  place of birth of the George Karrys",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Brown's_Corners,_Toronto> <municipality> ?uri .<George_Karrys> <placeOfBirth> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Brown's_Corners,_Toronto": {
                "name": "Brown's_Corners,_Toronto",
                "mention": "Brown's Corners, Toronto",
                "l_pos": 32,
                "r_pos": 55
            },
            "?uri": {
                "name": "?uri",
                "mention": "municipality",
                "l_pos": 12,
                "r_pos": 23
            },
            "http://dbpedia.org/resource/George_Karrys": {
                "name": "George_Karrys",
                "mention": "George Karrys",
                "l_pos": 93,
                "r_pos": 105
            }
        }
    },
    {
        "_id": "3424",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/militaryUnit> <http://dbpedia.org/resource/Norwalk_Trainband> . ?x <http://dbpedia.org/property/restingplace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "List the resting place of the people who served in Norwalk Trainband.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <militaryUnit> <Norwalk_Trainband> .?x <restingplace> ?uri .?x <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 30,
                "r_pos": 35
            },
            "http://dbpedia.org/resource/Norwalk_Trainband": {
                "name": "Norwalk_Trainband",
                "mention": "Norwalk Trainband",
                "l_pos": 51,
                "r_pos": 67
            },
            "?uri": {
                "name": "?uri",
                "mention": "resting place",
                "l_pos": 9,
                "r_pos": 21
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "people",
                "l_pos": 30,
                "r_pos": 35
            }
        }
    },
    {
        "_id": "4712",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }",
        "question": "Count the tenants of the stadiums owned by toronto.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <owner> <Toronto> .?x <tenants> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "stadiums",
                "l_pos": 25,
                "r_pos": 32
            },
            "http://dbpedia.org/resource/Toronto": {
                "name": "Toronto",
                "mention": "toronto",
                "l_pos": 43,
                "r_pos": 49
            },
            "?uri": {
                "name": "?uri",
                "mention": "tenants",
                "l_pos": 10,
                "r_pos": 16
            }
        }
    },
    {
        "_id": "758",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/jurisdiction> <http://dbpedia.org/resource/German-occupied_Europe> . ?x <http://dbpedia.org/ontology/leader> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GovernmentAgency>}",
        "question": "List the leaders of the government agencies whose jurisdiction was German-occupied Europe.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <jurisdiction> <German-occupied_Europe> .?x <leader> ?uri .?x <22-rdf-syntax-ns#type> <GovernmentAgency> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "government agencies",
                "l_pos": 24,
                "r_pos": 42
            },
            "http://dbpedia.org/resource/German-occupied_Europe": {
                "name": "German-occupied_Europe",
                "mention": "German-occupied Europe",
                "l_pos": 67,
                "r_pos": 88
            },
            "?uri": {
                "name": "?uri",
                "mention": "leaders",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/ontology/GovernmentAgency": {
                "name": "GovernmentAgency",
                "mention": "government agencies",
                "l_pos": 24,
                "r_pos": 42
            }
        }
    },
    {
        "_id": "2941",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Charles_LeMaire> <http://dbpedia.org/property/awards> ?uri. <http://dbpedia.org/resource/Eric_Roth> <http://dbpedia.org/ontology/award> ?uri}",
        "question": "What is the common award won by Charles LeMaire and Eric Roth",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Charles_LeMaire> <awards> ?uri .<Eric_Roth> <award> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Charles_LeMaire": {
                "name": "Charles_LeMaire",
                "mention": "Charles LeMaire",
                "l_pos": 32,
                "r_pos": 46
            },
            "?uri": {
                "name": "?uri",
                "mention": "award",
                "l_pos": 19,
                "r_pos": 23
            },
            "http://dbpedia.org/resource/Eric_Roth": {
                "name": "Eric_Roth",
                "mention": "Eric Roth",
                "l_pos": 52,
                "r_pos": 60
            }
        }
    },
    {
        "_id": "3590",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Brad_Paisley_discography> <http://dbpedia.org/property/artist> ?uri. <http://dbpedia.org/resource/Sea_Gayle_Music> <http://dbpedia.org/property/founder> ?uri}",
        "question": "Whci co founder of Sea gayle Music is also the artist of Brad Paisley Discography /",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Brad_Paisley_discography> <artist> ?uri .<Sea_Gayle_Music> <founder> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Brad_Paisley_discography": {
                "name": "Brad_Paisley_discography",
                "mention": "Brad Paisley Discography",
                "l_pos": 57,
                "r_pos": 80
            },
            "?uri": {
                "name": "?uri",
                "mention": "co founder",
                "l_pos": 5,
                "r_pos": 14
            },
            "http://dbpedia.org/resource/Sea_Gayle_Music": {
                "name": "Sea_Gayle_Music",
                "mention": "Sea gayle Music",
                "l_pos": 19,
                "r_pos": 33
            }
        }
    }
]