[
    {
        "_id": "598",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/restingplace> <http://dbpedia.org/resource/North_Bend,_Ohio> . ?uri <http://dbpedia.org/property/branch> <http://dbpedia.org/resource/Indiana_Territory>  . }",
        "question": "Whichd officer's final resting place is North Bend, ohio and belongs to Indiana Territory branch ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <restingplace> <North_Bend,_Ohio> .?uri <branch> <Indiana_Territory> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "resting place",
                "l_pos": 23,
                "r_pos": 35
            },
            "http://dbpedia.org/resource/North_Bend,_Ohio": {
                "name": "North_Bend,_Ohio",
                "mention": "North Bend, ohio",
                "l_pos": 40,
                "r_pos": 55
            },
            "http://dbpedia.org/resource/Indiana_Territory": {
                "name": "Indiana_Territory",
                "mention": "Indiana Territory",
                "l_pos": 72,
                "r_pos": 88
            }
        }
    },
    {
        "_id": "4038",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }",
        "question": "For everyone who died in paris, count their different fields of work.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <deathPlace> <Paris> .?x <fields> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "everyone",
                "l_pos": 4,
                "r_pos": 11
            },
            "http://dbpedia.org/resource/Paris": {
                "name": "Paris",
                "mention": "paris",
                "l_pos": 25,
                "r_pos": 29
            },
            "?uri": {
                "name": "?uri",
                "mention": "fields",
                "l_pos": 54,
                "r_pos": 59
            }
        }
    },
    {
        "_id": "170",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/athletics> <http://dbpedia.org/resource/National_Collegiate_Athletic_Association> . ?uri <http://dbpedia.org/property/education> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "Count the number of people who graduated from universities affiliated with the NCAA.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <athletics> <National_Collegiate_Athletic_Association> .?uri <education> ?x .?uri <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "universities",
                "l_pos": 46,
                "r_pos": 57
            },
            "http://dbpedia.org/resource/National_Collegiate_Athletic_Association": {
                "name": "National_Collegiate_Athletic_Association",
                "mention": "NCAA",
                "l_pos": 79,
                "r_pos": 82
            },
            "?uri": {
                "name": "?uri",
                "mention": "people",
                "l_pos": 20,
                "r_pos": 25
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "people",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "2842",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Allama_Matthews> <http://dbpedia.org/ontology/college> ?uri. <http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> <http://dbpedia.org/property/affiliation> ?uri}",
        "question": "Name the college of the Allama Matthews which also has affiliation with  Monroe Carell Jr. Children's Hospital at Vanderbilt",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Allama_Matthews> <college> ?uri .<Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt> <affiliation> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Allama_Matthews": {
                "name": "Allama_Matthews",
                "mention": "Allama Matthews",
                "l_pos": 24,
                "r_pos": 38
            },
            "?uri": {
                "name": "?uri",
                "mention": "college",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt": {
                "name": "Monroe_Carell_Jr._Children's_Hospital_at_Vanderbilt",
                "mention": "Monroe Carell Jr. Children's Hospital at Vanderbilt",
                "l_pos": 73,
                "r_pos": 123
            }
        }
    },
    {
        "_id": "131",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/chairman> <http://dbpedia.org/resource/Joan_Laporta> . ?x <http://dbpedia.org/property/name> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub>}",
        "question": "List the name of the soccer clubs whose chairman is Joan Laporta.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <chairman> <Joan_Laporta> .?x <name> ?uri .?x <22-rdf-syntax-ns#type> <SoccerClub> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "soccer clubs",
                "l_pos": 21,
                "r_pos": 32
            },
            "http://dbpedia.org/resource/Joan_Laporta": {
                "name": "Joan_Laporta",
                "mention": "Joan Laporta",
                "l_pos": 52,
                "r_pos": 63
            },
            "?uri": {
                "name": "?uri",
                "mention": "name",
                "l_pos": 9,
                "r_pos": 12
            },
            "http://dbpedia.org/ontology/SoccerClub": {
                "name": "SoccerClub",
                "mention": "soccer clubs",
                "l_pos": 21,
                "r_pos": 32
            }
        }
    },
    {
        "_id": "3189",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cheasty_Boulevard_South> <http://dbpedia.org/ontology/maintainedBy> ?uri. <http://dbpedia.org/resource/King_County,_Washington> <http://dbpedia.org/ontology/countySeat> ?uri}",
        "question": "Which mainter of  Cheasty Boulevard South is also the county seat of the King County, Washington ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Cheasty_Boulevard_South> <maintainedBy> ?uri .<King_County,_Washington> <countySeat> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Cheasty_Boulevard_South": {
                "name": "Cheasty_Boulevard_South",
                "mention": "Cheasty Boulevard South",
                "l_pos": 18,
                "r_pos": 40
            },
            "?uri": {
                "name": "?uri",
                "mention": "mainter",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/King_County,_Washington": {
                "name": "King_County,_Washington",
                "mention": "King County, Washington",
                "l_pos": 73,
                "r_pos": 95
            }
        }
    },
    {
        "_id": "1811",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2015_Pro_Duta_FC_season> <http://dbpedia.org/property/stadium> ?uri }",
        "question": "Name the stadium of 2015 Pro Duta FC season ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <2015_Pro_Duta_FC_season> <stadium> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/2015_Pro_Duta_FC_season": {
                "name": "2015_Pro_Duta_FC_season",
                "mention": "2015 Pro Duta FC season",
                "l_pos": 20,
                "r_pos": 42
            },
            "?uri": {
                "name": "?uri",
                "mention": "stadium",
                "l_pos": 9,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "4513",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/services> <http://dbpedia.org/resource/Nintendo_eShop>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
        "question": "To which company is the service \"Nintendo eShop\" associated with?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <services> <Nintendo_eShop> .?uri <22-rdf-syntax-ns#type> <Company> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "company",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Nintendo_eShop": {
                "name": "Nintendo_eShop",
                "mention": "Nintendo eShop",
                "l_pos": 33,
                "r_pos": 46
            },
            "http://dbpedia.org/ontology/Company": {
                "name": "Company",
                "mention": "company",
                "l_pos": 9,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "906",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }",
        "question": "Who is married to Tony Ramo",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <partner> <Tony_Romo> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            },
            "http://dbpedia.org/resource/Tony_Romo": {
                "name": "Tony_Romo",
                "mention": "Tony Ramo",
                "l_pos": 18,
                "r_pos": 26
            }
        }
    },
    {
        "_id": "2737",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/architect> <http://dbpedia.org/resource/Jens_Jensen_(landscape_architect)> . ?uri <http://dbpedia.org/ontology/deathPlace> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "Who are the people who died in a place architected by Jens Jensen",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <architect> <Jens_Jensen_(landscape_architect)> .?uri <deathPlace> ?x .?uri <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "place",
                "l_pos": 33,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Jens_Jensen_(landscape_architect)": {
                "name": "Jens_Jensen_(landscape_architect)",
                "mention": "Jens Jensen",
                "l_pos": 54,
                "r_pos": 64
            },
            "?uri": {
                "name": "?uri",
                "mention": "people",
                "l_pos": 12,
                "r_pos": 17
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "people",
                "l_pos": 12,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "909",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri }",
        "question": "Who wrote Heroman?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Heroman> <author> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Heroman": {
                "name": "Heroman",
                "mention": "Heroman",
                "l_pos": 10,
                "r_pos": 16
            },
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            }
        }
    }
]