[
    {
        "_id": "2223",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/England>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage>}",
        "question": "Count the drinks originated in England.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <origin> <England> .?uri <22-rdf-syntax-ns#type> <Beverage> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "drinks",
                "l_pos": 10,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/England": {
                "name": "England",
                "mention": "England",
                "l_pos": 31,
                "r_pos": 37
            },
            "http://dbpedia.org/ontology/Beverage": {
                "name": "Beverage",
                "mention": "drinks",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "2450",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/service> <http://dbpedia.org/resource/Electronics_manufacturing_services> . ?uri <http://dbpedia.org/ontology/manufacturer> ?x  . }",
        "question": "Give me a count of everything made by the company which offers electronical manufacturing too.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <service> <Electronics_manufacturing_services> .?uri <manufacturer> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "company",
                "l_pos": 42,
                "r_pos": 48
            },
            "http://dbpedia.org/resource/Electronics_manufacturing_services": {
                "name": "Electronics_manufacturing_services",
                "mention": "electronical manufacturing",
                "l_pos": 63,
                "r_pos": 88
            },
            "?uri": {
                "name": "?uri",
                "mention": "everything",
                "l_pos": 19,
                "r_pos": 28
            }
        }
    },
    {
        "_id": "3670",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/HBO> . ?x <http://dbpedia.org/ontology/producer> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "List the producer of the TV shows whose company is HBO.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <company> <HBO> .?x <producer> ?uri .?x <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "TV shows",
                "l_pos": 25,
                "r_pos": 32
            },
            "http://dbpedia.org/resource/HBO": {
                "name": "HBO",
                "mention": "HBO",
                "l_pos": 51,
                "r_pos": 53
            },
            "?uri": {
                "name": "?uri",
                "mention": "producer",
                "l_pos": 9,
                "r_pos": 16
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "TV shows",
                "l_pos": 25,
                "r_pos": 32
            }
        }
    },
    {
        "_id": "239",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }",
        "question": "Count the number of actors in Lucy Sullivan Is Getting Married.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { <Lucy_Sullivan_Is_Getting_Married> <starring> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married": {
                "name": "Lucy_Sullivan_Is_Getting_Married",
                "mention": "Lucy Sullivan Is Getting Married",
                "l_pos": 30,
                "r_pos": 61
            },
            "?uri": {
                "name": "?uri",
                "mention": "actors",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "2512",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }",
        "question": "Name a few whose live in a place where Indian English is an official language",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <officialLanguage> <Indian_English> .?uri <residence> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "place",
                "l_pos": 27,
                "r_pos": 31
            },
            "http://dbpedia.org/resource/Indian_English": {
                "name": "Indian_English",
                "mention": "Indian English",
                "l_pos": 39,
                "r_pos": 52
            },
            "?uri": {
                "name": "?uri",
                "mention": "whose",
                "l_pos": 11,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "2344",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Abraham> <http://dbpedia.org/property/veneratedIn> ?uri. <http://dbpedia.org/resource/Saima_Chowdhury> <http://dbpedia.org/property/religion> ?uri}",
        "question": "What is the venerated in of the Abraham and religion of the Saima Chowdhury",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Abraham> <veneratedIn> ?uri .<Saima_Chowdhury> <religion> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Abraham": {
                "name": "Abraham",
                "mention": "Abraham",
                "l_pos": 32,
                "r_pos": 38
            },
            "?uri": {
                "name": "?uri",
                "mention": "religion",
                "l_pos": 44,
                "r_pos": 51
            },
            "http://dbpedia.org/resource/Saima_Chowdhury": {
                "name": "Saima_Chowdhury",
                "mention": "Saima Chowdhury",
                "l_pos": 60,
                "r_pos": 74
            }
        }
    },
    {
        "_id": "1022",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._T._Krogh> <http://dbpedia.org/ontology/nationality> ?uri. <http://dbpedia.org/resource/Camilla_Martin> <http://dbpedia.org/ontology/country> ?uri}",
        "question": "What is the nationality of the J. T. Krogh which is also the  sovereign state of the Camilla Martin",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <J._T._Krogh> <nationality> ?uri .<Camilla_Martin> <country> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/J._T._Krogh": {
                "name": "J._T._Krogh",
                "mention": "J. T. Krogh",
                "l_pos": 31,
                "r_pos": 41
            },
            "?uri": {
                "name": "?uri",
                "mention": "nationality",
                "l_pos": 12,
                "r_pos": 22
            },
            "http://dbpedia.org/resource/Camilla_Martin": {
                "name": "Camilla_Martin",
                "mention": "Camilla Martin",
                "l_pos": 85,
                "r_pos": 98
            }
        }
    },
    {
        "_id": "58",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri. <http://dbpedia.org/resource/Sam_Carrick> <http://dbpedia.org/property/draftTeam> ?uri}",
        "question": "Which tenants of the Master Card center is also th draft team of Sam Carrrick ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <MasterCard_Centre> <tenants> ?uri .<Sam_Carrick> <draftTeam> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/MasterCard_Centre": {
                "name": "MasterCard_Centre",
                "mention": "Master Card center",
                "l_pos": 21,
                "r_pos": 38
            },
            "?uri": {
                "name": "?uri",
                "mention": "tenants",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/Sam_Carrick": {
                "name": "Sam_Carrick",
                "mention": "Sam Carrrick",
                "l_pos": 65,
                "r_pos": 76
            }
        }
    },
    {
        "_id": "1064",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Thomas_Darden> <http://dbpedia.org/ontology/militaryBranch> ?uri. <http://dbpedia.org/resource/Edwin_F._Hunter> <http://dbpedia.org/property/branch> ?uri}",
        "question": "What is the common military branch of the Thomas Darden and that of Edwin F. Hunter",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Thomas_Darden> <militaryBranch> ?uri .<Edwin_F._Hunter> <branch> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Thomas_Darden": {
                "name": "Thomas_Darden",
                "mention": "Thomas Darden",
                "l_pos": 42,
                "r_pos": 54
            },
            "?uri": {
                "name": "?uri",
                "mention": "military branch",
                "l_pos": 19,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Edwin_F._Hunter": {
                "name": "Edwin_F._Hunter",
                "mention": "Edwin F. Hunter",
                "l_pos": 68,
                "r_pos": 82
            }
        }
    },
    {
        "_id": "4195",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/LG_Optimus_Vu> <http://dbpedia.org/ontology/operatingSystem> ?uri. <http://dbpedia.org/resource/Dart_(programming_language)> <http://dbpedia.org/property/developer> ?uri}",
        "question": "What is the operating system of the LG Optimus Vu and also the developer of the Dart (programming language)",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <LG_Optimus_Vu> <operatingSystem> ?uri .<Dart_(programming_language)> <developer> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/LG_Optimus_Vu": {
                "name": "LG_Optimus_Vu",
                "mention": "LG Optimus Vu",
                "l_pos": 36,
                "r_pos": 48
            },
            "?uri": {
                "name": "?uri",
                "mention": "operating system",
                "l_pos": 12,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/Dart_(programming_language)": {
                "name": "Dart_(programming_language)",
                "mention": "Dart (programming language)",
                "l_pos": 80,
                "r_pos": 106
            }
        }
    },
    {
        "_id": "4073",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)> . ?x <http://dbpedia.org/ontology/homeStadium> ?uri  . }",
        "question": "Give me the number of home stadiums of teams managed by John Spencer.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <manager> <John_Spencer_(Scottish_footballer)> .?x <homeStadium> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "teams",
                "l_pos": 39,
                "r_pos": 43
            },
            "http://dbpedia.org/resource/John_Spencer_(Scottish_footballer)": {
                "name": "John_Spencer_(Scottish_footballer)",
                "mention": "John Spencer",
                "l_pos": 56,
                "r_pos": 67
            },
            "?uri": {
                "name": "?uri",
                "mention": "home stadiums",
                "l_pos": 22,
                "r_pos": 34
            }
        }
    },
    {
        "_id": "4959",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Awakening_(1980_film)> <http://dbpedia.org/property/starring> ?uri. <http://dbpedia.org/resource/55_Days_at_Peking> <http://dbpedia.org/ontology/starring> ?uri . }",
        "question": "Who starred in Awakening and fifety five days at peking ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <The_Awakening_(1980_film)> <starring> ?uri .<55_Days_at_Peking> <starring> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/The_Awakening_(1980_film)": {
                "name": "The_Awakening_(1980_film)",
                "mention": "Awakening",
                "l_pos": 15,
                "r_pos": 23
            },
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            },
            "http://dbpedia.org/resource/55_Days_at_Peking": {
                "name": "55_Days_at_Peking",
                "mention": "fifety five days at peking",
                "l_pos": 29,
                "r_pos": 54
            }
        }
    },
    {
        "_id": "942",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/Burbank,_California> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "List the television shows whose distributors are located at Burbank, California.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <locationCity> <Burbank,_California> .?uri <distributor> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "distributors",
                "l_pos": 32,
                "r_pos": 43
            },
            "http://dbpedia.org/resource/Burbank,_California": {
                "name": "Burbank,_California",
                "mention": "Burbank, California",
                "l_pos": 60,
                "r_pos": 78
            },
            "?uri": {
                "name": "?uri",
                "mention": "television shows",
                "l_pos": 9,
                "r_pos": 24
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "television shows",
                "l_pos": 9,
                "r_pos": 24
            }
        }
    },
    {
        "_id": "2671",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/institution> <http://dbpedia.org/resource/Harvard_Medical_School> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Medician>}",
        "question": "List the birthplace of the medicians who studied in Harvard.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <institution> <Harvard_Medical_School> .?x <birthPlace> ?uri .?x <22-rdf-syntax-ns#type> <Medician> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "medicians",
                "l_pos": 27,
                "r_pos": 35
            },
            "http://dbpedia.org/resource/Harvard_Medical_School": {
                "name": "Harvard_Medical_School",
                "mention": "Harvard",
                "l_pos": 52,
                "r_pos": 58
            },
            "?uri": {
                "name": "?uri",
                "mention": "birthplace",
                "l_pos": 9,
                "r_pos": 18
            },
            "http://dbpedia.org/ontology/Medician": {
                "name": "Medician",
                "mention": "medicians",
                "l_pos": 27,
                "r_pos": 35
            }
        }
    },
    {
        "_id": "4036",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Microsoft_Office_Picture_Manager> <http://dbpedia.org/ontology/license> ?uri. <http://dbpedia.org/resource/Apple_Productivity_Experience_Group> <http://dbpedia.org/ontology/product> ?uri}",
        "question": "Which license of the Microsoft Office Picture Manager is also the  product of the Apple Productivity Experience Group ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Microsoft_Office_Picture_Manager> <license> ?uri .<Apple_Productivity_Experience_Group> <product> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Microsoft_Office_Picture_Manager": {
                "name": "Microsoft_Office_Picture_Manager",
                "mention": "Microsoft Office Picture Manager",
                "l_pos": 21,
                "r_pos": 52
            },
            "?uri": {
                "name": "?uri",
                "mention": "license",
                "l_pos": 6,
                "r_pos": 12
            },
            "http://dbpedia.org/resource/Apple_Productivity_Experience_Group": {
                "name": "Apple_Productivity_Experience_Group",
                "mention": "Apple Productivity Experience Group",
                "l_pos": 82,
                "r_pos": 116
            }
        }
    },
    {
        "_id": "1688",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }",
        "question": "Count all the places where companies located in Ontario operate.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <locationCity> <Ontario> .?x <locations> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "companies",
                "l_pos": 27,
                "r_pos": 35
            },
            "http://dbpedia.org/resource/Ontario": {
                "name": "Ontario",
                "mention": "Ontario",
                "l_pos": 48,
                "r_pos": 54
            },
            "?uri": {
                "name": "?uri",
                "mention": "places",
                "l_pos": 14,
                "r_pos": 19
            }
        }
    },
    {
        "_id": "1496",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> }",
        "question": "Give me the characters who last appeared in Star Wars Episode 3",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <last> <Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "characters",
                "l_pos": 12,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith": {
                "name": "Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith",
                "mention": "Star Wars Episode 3",
                "l_pos": 44,
                "r_pos": 62
            }
        }
    },
    {
        "_id": "2003",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Michael_Deeley> . ?uri <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Jordan_Cronenweth>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "Movie's produced by Michael Deeley has Jordan Cronenweth as director of photography",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <producer> <Michael_Deeley> .?uri <cinematography> <Jordan_Cronenweth> .?uri <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "Movie",
                "l_pos": 0,
                "r_pos": 4
            },
            "http://dbpedia.org/resource/Michael_Deeley": {
                "name": "Michael_Deeley",
                "mention": "Michael Deeley",
                "l_pos": 20,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Jordan_Cronenweth": {
                "name": "Jordan_Cronenweth",
                "mention": "Jordan Cronenweth",
                "l_pos": 39,
                "r_pos": 55
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "Movie",
                "l_pos": 0,
                "r_pos": 4
            }
        }
    },
    {
        "_id": "3470",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Joe_Schilling>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MartialArtist>}",
        "question": "Give me all martial artists trained by Joe Schilling.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <trainer> <Joe_Schilling> .?uri <22-rdf-syntax-ns#type> <MartialArtist> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "martial artists",
                "l_pos": 12,
                "r_pos": 26
            },
            "http://dbpedia.org/resource/Joe_Schilling": {
                "name": "Joe_Schilling",
                "mention": "Joe Schilling",
                "l_pos": 39,
                "r_pos": 51
            },
            "http://dbpedia.org/ontology/MartialArtist": {
                "name": "MartialArtist",
                "mention": "martial artists",
                "l_pos": 12,
                "r_pos": 26
            }
        }
    },
    {
        "_id": "1472",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }",
        "question": "Count the different causes of death of Christians.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <religion> <Christianity> .?x <deathCause> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "Christians",
                "l_pos": 39,
                "r_pos": 48
            },
            "http://dbpedia.org/resource/Christianity": {
                "name": "Christianity",
                "mention": "Christians",
                "l_pos": 39,
                "r_pos": 48
            },
            "?uri": {
                "name": "?uri",
                "mention": "causes",
                "l_pos": 20,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "4620",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Democratic_Party_(United_States)> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>}",
        "question": "List the birth city of the politicians of Democratic Party.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <party> <Democratic_Party_(United_States)> .?x <birthPlace> ?uri .?x <22-rdf-syntax-ns#type> <Politician> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "politicians",
                "l_pos": 27,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Democratic_Party_(United_States)": {
                "name": "Democratic_Party_(United_States)",
                "mention": "Democratic Party",
                "l_pos": 42,
                "r_pos": 57
            },
            "?uri": {
                "name": "?uri",
                "mention": "birth city",
                "l_pos": 9,
                "r_pos": 18
            },
            "http://dbpedia.org/ontology/Politician": {
                "name": "Politician",
                "mention": "politicians",
                "l_pos": 27,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "3608",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Oysterhead> . ?uri <http://dbpedia.org/property/themeMusicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "Count all the shows whose music composers are in Oysterhead.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <associatedMusicalArtist> <Oysterhead> .?uri <themeMusicComposer> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "music composers",
                "l_pos": 26,
                "r_pos": 40
            },
            "http://dbpedia.org/resource/Oysterhead": {
                "name": "Oysterhead",
                "mention": "Oysterhead",
                "l_pos": 49,
                "r_pos": 58
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 14,
                "r_pos": 18
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 14,
                "r_pos": 18
            }
        }
    }
]