[
    {
        "_id": "3184",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Michael_Dell>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company>}",
        "question": "To which company is Michael Dell a father company? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <owningCompany> <Michael_Dell> .?uri <22-rdf-syntax-ns#type> <Company> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "company",
                "l_pos": 9,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/Michael_Dell": {
                "name": "Michael_Dell",
                "mention": "Michael Dell",
                "l_pos": 20,
                "r_pos": 31
            },
            "http://dbpedia.org/ontology/Company": {
                "name": "Company",
                "mention": "company",
                "l_pos": 42,
                "r_pos": 48
            }
        }
    },
    {
        "_id": "183",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Croix_de_guerre_1939\u20131945_(France)> . ?x <http://dbpedia.org/property/battles> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MilitaryConflict>}",
        "question": "Count the wars in which people awarded with the Croix de guerre fought.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <awards> <Croix_de_guerre_1939\u20131945_(France)> .?x <battles> ?uri .?uri <22-rdf-syntax-ns#type> <MilitaryConflict> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "people",
                "l_pos": 24,
                "r_pos": 29
            },
            "http://dbpedia.org/resource/Croix_de_guerre_1939\u20131945_(France)": {
                "name": "Croix_de_guerre_1939\u20131945_(France)",
                "mention": "Croix de guerre",
                "l_pos": 48,
                "r_pos": 62
            },
            "?uri": {
                "name": "?uri",
                "mention": "wars",
                "l_pos": 10,
                "r_pos": 13
            },
            "http://dbpedia.org/ontology/MilitaryConflict": {
                "name": "MilitaryConflict",
                "mention": "wars",
                "l_pos": 10,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "4446",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/leaderName> <http://dbpedia.org/resource/John_Tory> . ?uri <http://dbpedia.org/ontology/location> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building>}",
        "question": "Give me a list of all the buildings which are located in districts governed by John Tory.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <leaderName> <John_Tory> .?uri <location> ?x .?uri <22-rdf-syntax-ns#type> <Building> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "districts",
                "l_pos": 57,
                "r_pos": 65
            },
            "http://dbpedia.org/resource/John_Tory": {
                "name": "John_Tory",
                "mention": "John Tory",
                "l_pos": 79,
                "r_pos": 87
            },
            "?uri": {
                "name": "?uri",
                "mention": "buildings",
                "l_pos": 26,
                "r_pos": 34
            },
            "http://dbpedia.org/ontology/Building": {
                "name": "Building",
                "mention": "buildings",
                "l_pos": 26,
                "r_pos": 34
            }
        }
    },
    {
        "_id": "2267",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/coach> <http://dbpedia.org/resource/Rodney_Eade> . ?x <http://dbpedia.org/property/location> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SportsTeam>}",
        "question": "Where can i find teams whose coach has been Rodney Eade.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <coach> <Rodney_Eade> .?x <location> ?uri .?x <22-rdf-syntax-ns#type> <SportsTeam> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "coach",
                "l_pos": 29,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Rodney_Eade": {
                "name": "Rodney_Eade",
                "mention": "Rodney Eade",
                "l_pos": 44,
                "r_pos": 54
            },
            "?uri": {
                "name": "?uri",
                "mention": "teams",
                "l_pos": 17,
                "r_pos": 21
            },
            "http://dbpedia.org/ontology/SportsTeam": {
                "name": "SportsTeam",
                "mention": "teams",
                "l_pos": 17,
                "r_pos": 21
            }
        }
    },
    {
        "_id": "932",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }",
        "question": "List the awards given to the relatives of Gregorios Bernardakis.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Gregorios_Bernardakis> <relative> ?x .?x <award> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Gregorios_Bernardakis": {
                "name": "Gregorios_Bernardakis",
                "mention": "Gregorios Bernardakis",
                "l_pos": 42,
                "r_pos": 62
            },
            "?x": {
                "name": "?x",
                "mention": "relatives",
                "l_pos": 29,
                "r_pos": 37
            },
            "?uri": {
                "name": "?uri",
                "mention": "awards",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "3946",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/George_Arceneaux,_Jr.> <http://dbpedia.org/ontology/occupation> ?uri. <http://dbpedia.org/resource/Blanche_Bruce> <http://dbpedia.org/property/office> ?uri}",
        "question": "What is the job of the George Arceneaux, Jr. which is also the office of the Blanche Bruce",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <George_Arceneaux,_Jr.> <occupation> ?uri .<Blanche_Bruce> <office> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/George_Arceneaux,_Jr.": {
                "name": "George_Arceneaux,_Jr.",
                "mention": "George Arceneaux, Jr.",
                "l_pos": 23,
                "r_pos": 43
            },
            "?uri": {
                "name": "?uri",
                "mention": "job",
                "l_pos": 12,
                "r_pos": 14
            },
            "http://dbpedia.org/resource/Blanche_Bruce": {
                "name": "Blanche_Bruce",
                "mention": "Blanche Bruce",
                "l_pos": 77,
                "r_pos": 89
            }
        }
    },
    {
        "_id": "3172",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }",
        "question": "Give me the count of artist in the company whose Artist is Jean- Francois Cote ?",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <artist> <Jean-Fran\u00e7ois_Cot\u00e9> .?x <artist> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "company",
                "l_pos": 35,
                "r_pos": 41
            },
            "http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9": {
                "name": "Jean-Fran\u00e7ois_Cot\u00e9",
                "mention": "Jean- Francois Cote",
                "l_pos": 59,
                "r_pos": 77
            },
            "?uri": {
                "name": "?uri",
                "mention": "artist",
                "l_pos": 21,
                "r_pos": 26
            }
        }
    },
    {
        "_id": "1651",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/poleDriver> <http://dbpedia.org/resource/Mika_H\u00e4kkinen> . ?x <http://dbpedia.org/ontology/firstDriver> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GrandPrix>}",
        "question": "List the first drivers of Grand Prixes where Mika Hakkinen was a pole driver.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <poleDriver> <Mika_H\u00e4kkinen> .?x <firstDriver> ?uri .?x <22-rdf-syntax-ns#type> <GrandPrix> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "Grand Prixes",
                "l_pos": 26,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Mika_H\u00e4kkinen": {
                "name": "Mika_H\u00e4kkinen",
                "mention": "Mika Hakkinen",
                "l_pos": 45,
                "r_pos": 57
            },
            "?uri": {
                "name": "?uri",
                "mention": "first drivers",
                "l_pos": 9,
                "r_pos": 21
            },
            "http://dbpedia.org/ontology/GrandPrix": {
                "name": "GrandPrix",
                "mention": "Grand Prixes",
                "l_pos": 26,
                "r_pos": 37
            }
        }
    },
    {
        "_id": "1850",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/2015_MLS_All-Star_Game> <http://dbpedia.org/property/city> ?uri. <http://dbpedia.org/resource/The_Okee_Dokee_Brothers> <http://dbpedia.org/ontology/birthPlace> ?uri}",
        "question": "What is the city  of the 2015 MLS All-Star Game and birthplace of the The Okee Dokee Brothers",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <2015_MLS_All-Star_Game> <city> ?uri .<The_Okee_Dokee_Brothers> <birthPlace> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/2015_MLS_All-Star_Game": {
                "name": "2015_MLS_All-Star_Game",
                "mention": "2015 MLS All-Star Game",
                "l_pos": 25,
                "r_pos": 46
            },
            "?uri": {
                "name": "?uri",
                "mention": "city",
                "l_pos": 12,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/The_Okee_Dokee_Brothers": {
                "name": "The_Okee_Dokee_Brothers",
                "mention": "The Okee Dokee Brothers",
                "l_pos": 70,
                "r_pos": 92
            }
        }
    },
    {
        "_id": "4570",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/languageFamily> <http://dbpedia.org/resource/Germanic_languages> . ?uri <http://dbpedia.org/property/language> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer>}",
        "question": "List some writers which speak one of the Germanic languages.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <languageFamily> <Germanic_languages> .?uri <language> ?x .?uri <22-rdf-syntax-ns#type> <Writer> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "one",
                "l_pos": 30,
                "r_pos": 32
            },
            "http://dbpedia.org/resource/Germanic_languages": {
                "name": "Germanic_languages",
                "mention": "Germanic languages",
                "l_pos": 41,
                "r_pos": 58
            },
            "?uri": {
                "name": "?uri",
                "mention": "writers",
                "l_pos": 10,
                "r_pos": 16
            },
            "http://dbpedia.org/ontology/Writer": {
                "name": "Writer",
                "mention": "writers",
                "l_pos": 10,
                "r_pos": 16
            }
        }
    },
    {
        "_id": "845",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/predecessor> <http://dbpedia.org/resource/The_Comedy_Channel_(United_States)> . ?uri <http://dbpedia.org/property/distributor> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "What shows used to air on the channel which was earlier known as \"The Comedy Central\"?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <predecessor> <The_Comedy_Channel_(United_States)> .?uri <distributor> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "channel",
                "l_pos": 30,
                "r_pos": 36
            },
            "http://dbpedia.org/resource/The_Comedy_Channel_(United_States)": {
                "name": "The_Comedy_Channel_(United_States)",
                "mention": "The Comedy Central",
                "l_pos": 66,
                "r_pos": 83
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 5,
                "r_pos": 9
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 5,
                "r_pos": 9
            }
        }
    },
    {
        "_id": "4015",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }",
        "question": "Where is the mouth of the river whose tributary is Bjelimicka  Rijeka ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <rightTributary> <Bjelimi\u0107ka_Rijeka> .?x <mouthCountry> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "river",
                "l_pos": 26,
                "r_pos": 30
            },
            "http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka": {
                "name": "Bjelimi\u0107ka_Rijeka",
                "mention": "Bjelimicka  Rijeka",
                "l_pos": 51,
                "r_pos": 68
            },
            "?uri": {
                "name": "?uri",
                "mention": "mouth",
                "l_pos": 13,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "4825",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Cohoes,_New_York> <http://dbpedia.org/ontology/river> ?uri }",
        "question": "Which river goes through cohoes, NY",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Cohoes,_New_York> <river> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Cohoes,_New_York": {
                "name": "Cohoes,_New_York",
                "mention": "cohoes, NY",
                "l_pos": 25,
                "r_pos": 34
            },
            "?uri": {
                "name": "?uri",
                "mention": "river",
                "l_pos": 6,
                "r_pos": 10
            }
        }
    },
    {
        "_id": "1058",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Christopher_D\u00edaz_Figueroa> <http://dbpedia.org/property/residence> ?uri. <http://dbpedia.org/resource/Cruce_a_Nado_Internacional> <http://dbpedia.org/ontology/country> ?uri}",
        "question": "What is the official residence of the Christopher Daz Figuero which is also the  state of the Cruce a Nado Internacional",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Christopher_D\u00edaz_Figueroa> <residence> ?uri .<Cruce_a_Nado_Internacional> <country> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Christopher_D\u00edaz_Figueroa": {
                "name": "Christopher_D\u00edaz_Figueroa",
                "mention": "Christopher Daz Figuero",
                "l_pos": 38,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "residence",
                "l_pos": 21,
                "r_pos": 29
            },
            "http://dbpedia.org/resource/Cruce_a_Nado_Internacional": {
                "name": "Cruce_a_Nado_Internacional",
                "mention": "Cruce a Nado Internacional",
                "l_pos": 94,
                "r_pos": 119
            }
        }
    },
    {
        "_id": "3061",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AcademicJournal>}",
        "question": "Count  the journals in the field of Philosophy.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <discipline> <Philosophy> .?uri <22-rdf-syntax-ns#type> <AcademicJournal> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "journals",
                "l_pos": 11,
                "r_pos": 18
            },
            "http://dbpedia.org/resource/Philosophy": {
                "name": "Philosophy",
                "mention": "Philosophy",
                "l_pos": 36,
                "r_pos": 45
            },
            "http://dbpedia.org/ontology/AcademicJournal": {
                "name": "AcademicJournal",
                "mention": "journals",
                "l_pos": 11,
                "r_pos": 18
            }
        }
    },
    {
        "_id": "105",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/placeOfBirth> <http://dbpedia.org/resource/London> . ?uri <http://dbpedia.org/ontology/editing> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "List the movies whose editors are born in London.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <placeOfBirth> <London> .?uri <editing> ?x .?uri <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "editors",
                "l_pos": 22,
                "r_pos": 28
            },
            "http://dbpedia.org/resource/London": {
                "name": "London",
                "mention": "London",
                "l_pos": 42,
                "r_pos": 47
            },
            "?uri": {
                "name": "?uri",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "1137",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "question": "Count the number of religions followed by Janta Dal members.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <party> <Janata_Dal> .?x <religion> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "None",
                "l_pos": -1,
                "r_pos": -1
            },
            "http://dbpedia.org/resource/Janata_Dal": {
                "name": "Janata_Dal",
                "mention": "Janta Dal",
                "l_pos": 42,
                "r_pos": 50
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 20,
                "r_pos": 28
            }
        }
    },
    {
        "_id": "3042",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/cpu> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/InformationAppliance>}",
        "question": "Give me a list of computers whose CPU is in the US.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <locationCity> <United_States> .?uri <cpu> ?x .?uri <22-rdf-syntax-ns#type> <InformationAppliance> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "CPU",
                "l_pos": 34,
                "r_pos": 36
            },
            "http://dbpedia.org/resource/United_States": {
                "name": "United_States",
                "mention": "US",
                "l_pos": 48,
                "r_pos": 49
            },
            "?uri": {
                "name": "?uri",
                "mention": "computers",
                "l_pos": 18,
                "r_pos": 26
            },
            "http://dbpedia.org/ontology/InformationAppliance": {
                "name": "InformationAppliance",
                "mention": "computers",
                "l_pos": 18,
                "r_pos": 26
            }
        }
    },
    {
        "_id": "706",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }",
        "question": "Who is the spouse of Daniel Gibson? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <spouse> <Daniel_Gibson> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "spouse",
                "l_pos": 11,
                "r_pos": 16
            },
            "http://dbpedia.org/resource/Daniel_Gibson": {
                "name": "Daniel_Gibson",
                "mention": "Daniel Gibson",
                "l_pos": 21,
                "r_pos": 33
            }
        }
    },
    {
        "_id": "1523",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)> <http://dbpedia.org/ontology/draftTeam> ?uri. <http://dbpedia.org/resource/MasterCard_Centre> <http://dbpedia.org/property/tenants> ?uri}",
        "question": "Which draft team od Dale Mitchell is also the tenant of Master Card center /",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Dale_Mitchell_(ice_hockey)> <draftTeam> ?uri .<MasterCard_Centre> <tenants> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Dale_Mitchell_(ice_hockey)": {
                "name": "Dale_Mitchell_(ice_hockey)",
                "mention": "Dale Mitchell",
                "l_pos": 20,
                "r_pos": 32
            },
            "?uri": {
                "name": "?uri",
                "mention": "draft team",
                "l_pos": 6,
                "r_pos": 15
            },
            "http://dbpedia.org/resource/MasterCard_Centre": {
                "name": "MasterCard_Centre",
                "mention": "Master Card center",
                "l_pos": 56,
                "r_pos": 73
            }
        }
    }
]