[
    {
        "_id": "100",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }",
        "question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <commander> <Roundhead_(Wyandot)> .?x <commander> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "military conflicts",
                "l_pos": 45,
                "r_pos": 62
            },
            "http://dbpedia.org/resource/Roundhead_(Wyandot)": {
                "name": "Roundhead_(Wyandot)",
                "mention": "Roundhead (Wyandot)",
                "l_pos": 83,
                "r_pos": 101
            },
            "?uri": {
                "name": "?uri",
                "mention": "commander",
                "l_pos": 28,
                "r_pos": 36
            }
        }
    },
    {
        "_id": "877",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }",
        "question": "Count all the things licensed as Software as a service.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?uri <license> <Software_as_a_service> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "things",
                "l_pos": 14,
                "r_pos": 19
            },
            "http://dbpedia.org/resource/Software_as_a_service": {
                "name": "Software_as_a_service",
                "mention": "Software as a service",
                "l_pos": 33,
                "r_pos": 53
            }
        }
    },
    {
        "_id": "3676",
        "raw_sparql": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }",
        "question": "Is Eddie Bravo the trainer of Alan Jouban",
        "readable_sparql": "ASK WHERE { <Alan_Jouban> <trainer> <Eddie_Bravo> . }",
        "node_set": {
            "http://dbpedia.org/resource/Alan_Jouban": {
                "name": "Alan_Jouban",
                "mention": "Alan Jouban",
                "l_pos": 30,
                "r_pos": 40
            },
            "http://dbpedia.org/resource/Eddie_Bravo": {
                "name": "Eddie_Bravo",
                "mention": "Eddie Bravo",
                "l_pos": 3,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "277",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Providence_Chapel,_Charlwood> <http://dbpedia.org/property/style> ?uri. <http://dbpedia.org/resource/Joseph_Case_High_School> <http://dbpedia.org/ontology/region> ?uri}",
        "question": "WHich region of the Providence Chapel, Charlwood is also the region of the Joseph Case High School",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Providence_Chapel,_Charlwood> <style> ?uri .<Joseph_Case_High_School> <region> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Providence_Chapel,_Charlwood": {
                "name": "Providence_Chapel,_Charlwood",
                "mention": "Providence Chapel, Charlwood",
                "l_pos": 20,
                "r_pos": 47
            },
            "?uri": {
                "name": "?uri",
                "mention": "region",
                "l_pos": 6,
                "r_pos": 11
            },
            "http://dbpedia.org/resource/Joseph_Case_High_School": {
                "name": "Joseph_Case_High_School",
                "mention": "Joseph Case High School",
                "l_pos": 75,
                "r_pos": 97
            }
        }
    },
    {
        "_id": "1544",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Martin_Crane> <http://dbpedia.org/property/children> ?uri }",
        "question": "To whom did Martin Crane gave birth?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Martin_Crane> <children> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Martin_Crane": {
                "name": "Martin_Crane",
                "mention": "Martin Crane",
                "l_pos": 12,
                "r_pos": 23
            },
            "?uri": {
                "name": "?uri",
                "mention": "whom",
                "l_pos": 3,
                "r_pos": 6
            }
        }
    },
    {
        "_id": "2791",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)> <http://dbpedia.org/ontology/musicalArtist> ?x . ?x <http://dbpedia.org/ontology/associatedMusicalArtist> ?uri  . }",
        "question": "With which musical artist is the music group which sung Mind Blowin' related to ?  ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Mind_Blowin'_(Smooth_song)> <musicalArtist> ?x .?x <associatedMusicalArtist> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Mind_Blowin'_(Smooth_song)": {
                "name": "Mind_Blowin'_(Smooth_song)",
                "mention": "Mind Blowin'",
                "l_pos": 56,
                "r_pos": 67
            },
            "?x": {
                "name": "?x",
                "mention": "music group",
                "l_pos": 33,
                "r_pos": 43
            },
            "?uri": {
                "name": "?uri",
                "mention": "musical artist",
                "l_pos": 11,
                "r_pos": 24
            }
        }
    }
]