[
    {
        "_id": "2633",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }",
        "question": "Count all those whose youth club was managed by Luis Enrique.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <manager> <Luis_Enrique_(footballer)> .?uri <youthclubs> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "youth club",
                "l_pos": 22,
                "r_pos": 31
            },
            "http://dbpedia.org/resource/Luis_Enrique_(footballer)": {
                "name": "Luis_Enrique_(footballer)",
                "mention": "Luis Enrique",
                "l_pos": 48,
                "r_pos": 59
            },
            "?uri": {
                "name": "?uri",
                "mention": "those",
                "l_pos": 10,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "1739",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/operatingSystem> <http://dbpedia.org/resource/Mac_OS>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Software>}",
        "question": "Give me some softwares which run on mac os",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <operatingSystem> <Mac_OS> .?uri <22-rdf-syntax-ns#type> <Software> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "softwares",
                "l_pos": 13,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Mac_OS": {
                "name": "Mac_OS",
                "mention": "mac os",
                "l_pos": 36,
                "r_pos": 41
            },
            "http://dbpedia.org/ontology/Software": {
                "name": "Software",
                "mention": "softwares",
                "l_pos": 13,
                "r_pos": 21
            }
        }
    },
    {
        "_id": "3654",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "question": "List the religions of the commanders of Royal Thai Army.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Royal_Thai_Army> <notableCommanders> ?x .?x <religion> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Royal_Thai_Army": {
                "name": "Royal_Thai_Army",
                "mention": "Royal Thai Army",
                "l_pos": 40,
                "r_pos": 54
            },
            "?x": {
                "name": "?x",
                "mention": "the commanders",
                "l_pos": 22,
                "r_pos": 35
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 9,
                "r_pos": 17
            }
        }
    },
    {
        "_id": "584",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/J._P._Paris\u00e9> <http://dbpedia.org/property/playedFor> ?uri. <http://dbpedia.org/resource/Bert_McCaffrey> <http://dbpedia.org/ontology/formerTeam> ?uri . }",
        "question": "What team did J P Paris play for and was former team of Bert McCaffrey ?",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <J._P._Paris\u00e9> <playedFor> ?uri .<Bert_McCaffrey> <formerTeam> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/J._P._Paris\u00e9": {
                "name": "J._P._Paris\u00e9",
                "mention": "J P Paris",
                "l_pos": 14,
                "r_pos": 22
            },
            "?uri": {
                "name": "?uri",
                "mention": "team",
                "l_pos": 5,
                "r_pos": 8
            },
            "http://dbpedia.org/resource/Bert_McCaffrey": {
                "name": "Bert_McCaffrey",
                "mention": "Bert McCaffrey",
                "l_pos": 56,
                "r_pos": 69
            }
        }
    },
    {
        "_id": "4299",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }",
        "question": "Count the different religions followed by Second Lieutenants in military.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <militaryRank> <Second_lieutenant> .?x <religion> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "Second Lieutenants",
                "l_pos": 42,
                "r_pos": 59
            },
            "http://dbpedia.org/resource/Second_lieutenant": {
                "name": "Second_lieutenant",
                "mention": "Second Lieutenants",
                "l_pos": 42,
                "r_pos": 59
            },
            "?uri": {
                "name": "?uri",
                "mention": "religions",
                "l_pos": 20,
                "r_pos": 28
            }
        }
    },
    {
        "_id": "4861",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/foundation> <http://dbpedia.org/resource/New_York> . ?uri <http://dbpedia.org/ontology/board> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "List the people whose are in the board of an organization kickstarted in New York.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <foundation> <New_York> .?uri <board> ?x .?uri <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "organization",
                "l_pos": 45,
                "r_pos": 56
            },
            "http://dbpedia.org/resource/New_York": {
                "name": "New_York",
                "mention": "New York",
                "l_pos": 73,
                "r_pos": 80
            },
            "?uri": {
                "name": "?uri",
                "mention": "people",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "people",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "2654",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }",
        "question": "List all those whose relatives' nationality is United States.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <nationality> <United_States> .?uri <relative> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "relatives",
                "l_pos": 21,
                "r_pos": 29
            },
            "http://dbpedia.org/resource/United_States": {
                "name": "United_States",
                "mention": "United States",
                "l_pos": 47,
                "r_pos": 59
            },
            "?uri": {
                "name": "?uri",
                "mention": "those",
                "l_pos": 9,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "1260",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Alcal\u00e1_de_Henares> . ?uri <http://dbpedia.org/ontology/author> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book>}",
        "question": "List the books whose authors are in Alcal de Henares.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <birthPlace> <Alcal\u00e1_de_Henares> .?uri <author> ?x .?uri <22-rdf-syntax-ns#type> <Book> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "authors",
                "l_pos": 21,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/Alcal\u00e1_de_Henares": {
                "name": "Alcal\u00e1_de_Henares",
                "mention": "Alcal de Henares",
                "l_pos": 36,
                "r_pos": 51
            },
            "?uri": {
                "name": "?uri",
                "mention": "books",
                "l_pos": 9,
                "r_pos": 13
            },
            "http://dbpedia.org/ontology/Book": {
                "name": "Book",
                "mention": "books",
                "l_pos": 9,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "4676",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/International_Association_of_Universities> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }",
        "question": "Estimate the number of sports divisions at the universities under international association of universities.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <affiliation> <International_Association_of_Universities> .?x <sport> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "universities",
                "l_pos": 47,
                "r_pos": 58
            },
            "http://dbpedia.org/resource/International_Association_of_Universities": {
                "name": "International_Association_of_Universities",
                "mention": "international association of universities",
                "l_pos": 66,
                "r_pos": 106
            },
            "?uri": {
                "name": "?uri",
                "mention": "sports divisions",
                "l_pos": 23,
                "r_pos": 38
            }
        }
    },
    {
        "_id": "3159",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> }",
        "question": "Who all have been canonized by Pope Paul VI",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <canonizedBy> <Pope_Paul_VI> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "Who",
                "l_pos": 0,
                "r_pos": 2
            },
            "http://dbpedia.org/resource/Pope_Paul_VI": {
                "name": "Pope_Paul_VI",
                "mention": "Pope Paul VI",
                "l_pos": 31,
                "r_pos": 42
            }
        }
    },
    {
        "_id": "1157",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Amblin_Television> . ?uri <http://dbpedia.org/ontology/company> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "List the shows whose company's successor is Amblin Television.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <successor> <Amblin_Television> .?uri <company> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "company",
                "l_pos": 21,
                "r_pos": 27
            },
            "http://dbpedia.org/resource/Amblin_Television": {
                "name": "Amblin_Television",
                "mention": "Amblin Television",
                "l_pos": 44,
                "r_pos": 60
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 9,
                "r_pos": 13
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 9,
                "r_pos": 13
            }
        }
    },
    {
        "_id": "1189",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/BBC_Multimedia> <http://dbpedia.org/property/products> ?uri. <http://dbpedia.org/resource/The_Last_Resort_(Doctor_Who)> <http://dbpedia.org/ontology/series> ?uri}",
        "question": "What is the products of the BBC Multimedia and series of the The Last Resort (Doctor Who)",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <BBC_Multimedia> <products> ?uri .<The_Last_Resort_(Doctor_Who)> <series> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/BBC_Multimedia": {
                "name": "BBC_Multimedia",
                "mention": "BBC Multimedia",
                "l_pos": 28,
                "r_pos": 41
            },
            "?uri": {
                "name": "?uri",
                "mention": "products",
                "l_pos": 12,
                "r_pos": 19
            },
            "http://dbpedia.org/resource/The_Last_Resort_(Doctor_Who)": {
                "name": "The_Last_Resort_(Doctor_Who)",
                "mention": "The Last Resort (Doctor Who)",
                "l_pos": 61,
                "r_pos": 88
            }
        }
    },
    {
        "_id": "1616",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }",
        "question": "List everything in which saxophone players have been casted.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <instrument> <Saxophone> .?uri <starring> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "players",
                "l_pos": 35,
                "r_pos": 41
            },
            "http://dbpedia.org/resource/Saxophone": {
                "name": "Saxophone",
                "mention": "saxophone",
                "l_pos": 25,
                "r_pos": 33
            },
            "?uri": {
                "name": "?uri",
                "mention": "everything",
                "l_pos": 5,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "3467",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }",
        "question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Ann_Monroe_Gilchrist_Strong> <birthPlace> ?x .?x <country> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong": {
                "name": "Ann_Monroe_Gilchrist_Strong",
                "mention": "Ann Monroe Gilchrist Strong",
                "l_pos": 37,
                "r_pos": 63
            },
            "?x": {
                "name": "?x",
                "mention": "birth location",
                "l_pos": 19,
                "r_pos": 32
            },
            "?uri": {
                "name": "?uri",
                "mention": "state",
                "l_pos": 6,
                "r_pos": 10
            }
        }
    },
    {
        "_id": "1289",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/purpose> <http://dbpedia.org/resource/Environmentalism>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>}",
        "question": "Give me some organizations working for Environmentalism",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <purpose> <Environmentalism> .?uri <22-rdf-syntax-ns#type> <Organisation> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "organizations",
                "l_pos": 13,
                "r_pos": 25
            },
            "http://dbpedia.org/resource/Environmentalism": {
                "name": "Environmentalism",
                "mention": "Environmentalism",
                "l_pos": 39,
                "r_pos": 54
            },
            "http://dbpedia.org/ontology/Organisation": {
                "name": "Organisation",
                "mention": "organizations",
                "l_pos": 13,
                "r_pos": 25
            }
        }
    },
    {
        "_id": "237",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }",
        "question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <federalState> <Mecklenburg-Vorpommern> .?uri <cities> ?x . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "cities",
                "l_pos": 35,
                "r_pos": 40
            },
            "http://dbpedia.org/resource/Mecklenburg-Vorpommern": {
                "name": "Mecklenburg-Vorpommern",
                "mention": "Mecklenburg-Vorpommern",
                "l_pos": 58,
                "r_pos": 79
            },
            "?uri": {
                "name": "?uri",
                "mention": "places",
                "l_pos": 5,
                "r_pos": 10
            }
        }
    },
    {
        "_id": "1452",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/deathCause> <http://dbpedia.org/resource/Hanging> . ?x <http://dbpedia.org/ontology/opponent> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person>}",
        "question": "List some people who were opponents of someone who was died by hanging? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <deathCause> <Hanging> .?x <opponent> ?uri .?x <22-rdf-syntax-ns#type> <Person> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "someone",
                "l_pos": 39,
                "r_pos": 45
            },
            "http://dbpedia.org/resource/Hanging": {
                "name": "Hanging",
                "mention": "hanging",
                "l_pos": 63,
                "r_pos": 69
            },
            "?uri": {
                "name": "?uri",
                "mention": "people",
                "l_pos": 10,
                "r_pos": 15
            },
            "http://dbpedia.org/ontology/Person": {
                "name": "Person",
                "mention": "people",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "664",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/associatedActs> <http://dbpedia.org/resource/Jon_and_Vangelis> . ?uri <http://dbpedia.org/ontology/musicComposer> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "List the movies whose music composer is often associated with Jon and Vangelis.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <associatedActs> <Jon_and_Vangelis> .?uri <musicComposer> ?x .?uri <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "music composer",
                "l_pos": 22,
                "r_pos": 35
            },
            "http://dbpedia.org/resource/Jon_and_Vangelis": {
                "name": "Jon_and_Vangelis",
                "mention": "Jon and Vangelis",
                "l_pos": 62,
                "r_pos": 77
            },
            "?uri": {
                "name": "?uri",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "movies",
                "l_pos": 9,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "2132",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/themeMusicComposer> <http://dbpedia.org/resource/Murray_Gold> . ?uri <http://dbpedia.org/ontology/related> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>}",
        "question": "Name some shows similar to the one whose theme song is made by Murray Gold.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <themeMusicComposer> <Murray_Gold> .?uri <related> ?x .?uri <22-rdf-syntax-ns#type> <TelevisionShow> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "one",
                "l_pos": 31,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Murray_Gold": {
                "name": "Murray_Gold",
                "mention": "Murray Gold",
                "l_pos": 63,
                "r_pos": 73
            },
            "?uri": {
                "name": "?uri",
                "mention": "shows",
                "l_pos": 10,
                "r_pos": 14
            },
            "http://dbpedia.org/ontology/TelevisionShow": {
                "name": "TelevisionShow",
                "mention": "shows",
                "l_pos": 10,
                "r_pos": 14
            }
        }
    },
    {
        "_id": "1310",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/division> <http://dbpedia.org/resource/Flowering_plant> . ?uri <http://dbpedia.org/ontology/ingredient> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Food>}",
        "question": "Name some dishes made with flowering plants.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <division> <Flowering_plant> .?uri <ingredient> ?x .?uri <22-rdf-syntax-ns#type> <Food> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "None",
                "l_pos": -1,
                "r_pos": -1
            },
            "http://dbpedia.org/resource/Flowering_plant": {
                "name": "Flowering_plant",
                "mention": "flowering plants",
                "l_pos": 27,
                "r_pos": 42
            },
            "?uri": {
                "name": "?uri",
                "mention": "dishes",
                "l_pos": 10,
                "r_pos": 15
            },
            "http://dbpedia.org/ontology/Food": {
                "name": "Food",
                "mention": "dishes",
                "l_pos": 10,
                "r_pos": 15
            }
        }
    },
    {
        "_id": "3052",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/SAGE_Publications> . ?x <http://dbpedia.org/ontology/academicDiscipline> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/AcademicJournal>}",
        "question": "List the academic discipline of the journals whose publisher is SAGE Publications.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <publisher> <SAGE_Publications> .?x <academicDiscipline> ?uri .?x <22-rdf-syntax-ns#type> <AcademicJournal> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "journals",
                "l_pos": 36,
                "r_pos": 43
            },
            "http://dbpedia.org/resource/SAGE_Publications": {
                "name": "SAGE_Publications",
                "mention": "SAGE Publications",
                "l_pos": 64,
                "r_pos": 80
            },
            "?uri": {
                "name": "?uri",
                "mention": "academic discipline",
                "l_pos": 9,
                "r_pos": 27
            },
            "http://dbpedia.org/ontology/AcademicJournal": {
                "name": "AcademicJournal",
                "mention": "journals",
                "l_pos": 36,
                "r_pos": 43
            }
        }
    },
    {
        "_id": "4198",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }",
        "question": "List the alma mater of the person who is wedded to Sissela Bok.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <spouse> <Sissela_Bok> .?x <almaMater> ?uri . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "person",
                "l_pos": 27,
                "r_pos": 32
            },
            "http://dbpedia.org/resource/Sissela_Bok": {
                "name": "Sissela_Bok",
                "mention": "Sissela Bok",
                "l_pos": 51,
                "r_pos": 61
            },
            "?uri": {
                "name": "?uri",
                "mention": "alma mater",
                "l_pos": 9,
                "r_pos": 18
            }
        }
    },
    {
        "_id": "458",
        "raw_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/Vitis_vinifera> . ?x <http://dbpedia.org/ontology/origin> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Place>}",
        "question": "Count the different origins of members of the Vitis Vinifera species.",
        "readable_sparql": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <species> <Vitis_vinifera> .?x <origin> ?uri .?uri <22-rdf-syntax-ns#type> <Place> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "members",
                "l_pos": 31,
                "r_pos": 37
            },
            "http://dbpedia.org/resource/Vitis_vinifera": {
                "name": "Vitis_vinifera",
                "mention": "Vitis Vinifera",
                "l_pos": 46,
                "r_pos": 59
            },
            "?uri": {
                "name": "?uri",
                "mention": "origins",
                "l_pos": 20,
                "r_pos": 26
            },
            "http://dbpedia.org/ontology/Place": {
                "name": "Place",
                "mention": "origins",
                "l_pos": 20,
                "r_pos": 26
            }
        }
    },
    {
        "_id": "2084",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/champion> <http://dbpedia.org/resource/Golden_State_Warriors>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballLeague>}",
        "question": "What basketball league's champion is Golden State Warriors",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?uri <champion> <Golden_State_Warriors> .?uri <22-rdf-syntax-ns#type> <BasketballLeague> . }",
        "node_set": {
            "?uri": {
                "name": "?uri",
                "mention": "basketball league",
                "l_pos": 5,
                "r_pos": 21
            },
            "http://dbpedia.org/resource/Golden_State_Warriors": {
                "name": "Golden_State_Warriors",
                "mention": "Golden State Warriors",
                "l_pos": 37,
                "r_pos": 57
            },
            "http://dbpedia.org/ontology/BasketballLeague": {
                "name": "BasketballLeague",
                "mention": "basketball league",
                "l_pos": 5,
                "r_pos": 21
            }
        }
    },
    {
        "_id": "250",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Mark_Johnson_(producer)> . ?x <http://dbpedia.org/ontology/starring> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>}",
        "question": "List the cast member of the movies whose producer is Mark Johnson.",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { ?x <producer> <Mark_Johnson_(producer)> .?x <starring> ?uri .?x <22-rdf-syntax-ns#type> <Film> . }",
        "node_set": {
            "?x": {
                "name": "?x",
                "mention": "movies",
                "l_pos": 28,
                "r_pos": 33
            },
            "http://dbpedia.org/resource/Mark_Johnson_(producer)": {
                "name": "Mark_Johnson_(producer)",
                "mention": "Mark Johnson",
                "l_pos": 53,
                "r_pos": 64
            },
            "?uri": {
                "name": "?uri",
                "mention": "cast member",
                "l_pos": 9,
                "r_pos": 19
            },
            "http://dbpedia.org/ontology/Film": {
                "name": "Film",
                "mention": "movies",
                "l_pos": 28,
                "r_pos": 33
            }
        }
    },
    {
        "_id": "3029",
        "raw_sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Butch_Metzger> <http://dbpedia.org/ontology/debutTeam> ?uri. <http://dbpedia.org/resource/Brian_Horwitz> <http://dbpedia.org/ontology/debutTeam> ?uri . }",
        "question": "For which team did both Butch Metzger and Brian Horwitz debuted ? ",
        "readable_sparql": "SELECT DISTINCT ?uri WHERE { <Butch_Metzger> <debutTeam> ?uri .<Brian_Horwitz> <debutTeam> ?uri . }",
        "node_set": {
            "http://dbpedia.org/resource/Butch_Metzger": {
                "name": "Butch_Metzger",
                "mention": "Butch Metzger",
                "l_pos": 24,
                "r_pos": 36
            },
            "?uri": {
                "name": "?uri",
                "mention": "team",
                "l_pos": 10,
                "r_pos": 13
            },
            "http://dbpedia.org/resource/Brian_Horwitz": {
                "name": "Brian_Horwitz",
                "mention": "Brian Horwitz",
                "l_pos": 42,
                "r_pos": 54
            }
        }
    }
]